/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*                                  
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 安全通讯公共部分
*
*  文件名称    : SafetyCommon.h
*
*  功能简介    : 安全通讯公共部分处理
*
*  作者        : 王东
*
*  创建日期    : 2016-04-18
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/

#include "../inc/SafetyCommon.h"

/*
***********************************************************************************************************************
*                                局部变量声明
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
*                                局部函数声明
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
*                                全局函数实现
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: UpdateTolInfo
*
* 功能描述: 更新容忍次数和重新计算容忍门限值
*
* 输入参数: pucTolCnt：待更新的容忍次数；
*          pucTolThr：待更新的容忍门限值。
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void UpdateTolInfo( uint8_t *pucTolCnt, uint8_t *pucTolThr )
{
    if((pucTolCnt != NULL) &&
       (pucTolThr != NULL ))
    {
        *pucTolCnt = SysGetTolCnt();
        *pucTolThr = ( *pucTolCnt + 1U ) * 8U - 4U;
    }
}

/*
***********************************************************************************************************************
* 函数名称: HandleSafetyCommError
*
* 功能描述: 安全通讯错误处理函数
*
* 输入参数: pstErrInfo：错误信息；
*          ucTolThr：容忍门限值。
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void HandleSafetyCommError( CommErrorInfo_t *pstErrInfo, uint8_t ucTolThr )
{
    if( pstErrInfo != NULL )
    {
        if((pstErrInfo->usErrCnt + 8U) <= (uint16_t)(MAX_ERR_CNTS))
        {
            pstErrInfo->usErrCnt += 8U;
        }

        if( pstErrInfo->usErrCnt >= ucTolThr )
        {
            pstErrInfo->bErrFlag = true;
            pstErrInfo->bTolFlag = false;
        }
        else
        {
            pstErrInfo->bTolFlag = true;
            pstErrInfo->bErrFlag = false;
        }
    }
}

/*
***********************************************************************************************************************
* 函数名称: HandleSafetyCommRecover
*
* 功能描述: 安全通讯恢复处理函数
*
* 输入参数: pstErrInfo：错误信息
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void HandleSafetyCommRecover( CommErrorInfo_t *pstErrInfo )
{
    if( pstErrInfo != NULL )
    {
        if( pstErrInfo->bErrFlag )
        {
            if( pstErrInfo->usErrCnt >= 8U )
            {
                pstErrInfo->usErrCnt -= 8U;
            }

            if( 0U == pstErrInfo->usErrCnt )
            {
                pstErrInfo->bErrFlag = false;
            }
        }
        else if( pstErrInfo->bTolFlag )
        {
            pstErrInfo->bTolFlag = false;
            if( pstErrInfo->usErrCnt > 0U )
            {
                pstErrInfo->usErrCnt -= 1U;
            }
        }
        else
        {
            if( pstErrInfo->usErrCnt > 0U )
            {
                pstErrInfo->usErrCnt -= 1U;
            }
        }
    }
}

/*
***********************************************************************************************************************
* 函数名称: CompareData
*
* 功能描述: 比较数据是否相同
*
* 输入参数: pucData1：数据1首地址；
*          pucData2：数据2首地址；
*          uiDataLen：数据长度。
*
* 输出参数: 无
*
* 返 回 值: 是否相同
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t CompareData( uint8_t const pucData1[], uint8_t const pucData2[], uint32_t uiDataLen )
{
    bool_t bSame = false;
    uint32_t uiIndex = 0U;

    if((pucData1 != NULL) &&
       (pucData2 != NULL))
    {
        bSame = true;
        for( uiIndex = 0U; uiIndex < uiDataLen; uiIndex++ )
        {
            if( pucData1[uiIndex] != pucData2[uiIndex])
            {
                bSame = false;
                break;
            }
        }
    }

    return bSame;
}

/*
***********************************************************************************************************************
* 函数名称: ReverseData
*
* 功能描述: 翻转数据：按位翻转
*
* 输入参数: pucSrcData：原始数据首地址；
*          uiDataLen：数据长度；
*          pucDstData：目标数据首地址。
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void ReverseData( uint8_t pucSrcData[], uint32_t uiDataLen, uint8_t pucDstData[])
{
    uint32_t uiIndex = 0U;  /* Index */

    if((pucSrcData != NULL) && (pucDstData != NULL))
    {
        for( uiIndex = 0U; uiIndex < uiDataLen; uiIndex++ )
        {
            pucDstData[uiIndex] = ~pucSrcData[uiIndex];
        }
    }
}


/*
***********************************************************************************************************************
*                                局部函数实现
***********************************************************************************************************************
*/



/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/

