/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
* 
*  模块名称    : 系统资源管理模块
*
*  文件名称    : SysHardware.c
*
*  功能简介    :
*
*  作者        : 李琦
*
*  创建日期    : 2016-05-13
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "../inc/SysHardware.h"
#include <Srv/Scheduler/cagos.h>

/*
***********************************************************************************************************************
*                                局部变量声明
***********************************************************************************************************************
*/
const float_t fTempFractionalValue[16]={ 0.0000, 0.0625, 0.1250, 0.1875,
                                         0.2500, 0.3125, 0.3750, 0.4375,
                                         0.5000, 0.5625, 0.6250, 0.6875,
                                         0.7500, 0.8125, 0.8750, 0.9375
                                       };
/*
***********************************************************************************************************************
*                                局部函数声明
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
*                                全局函数实现
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: GetTemperature
*
* 功能描述: 获取温度
*
* 输入参数: 无
*
* 输出参数: pfTemp: 指向获取的温度值
*        bpValid: 温度值是否有效
*
* 返 回 值  : 读取温度是否成功
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t GetTemperature(float_t *pfTemp, bool_t *bpValid)
{
    bool_t bRet = false;
    bool_t bValid = false;
    uint16_t usRegVal = 0;
    uint16_t usTemp = 0;
    float_t fTemp = 0.0;
    uint8_t ucIndex = 0;

    if((pfTemp != NULL) && (bpValid != NULL))
    {
        usRegVal = fpga_read(REG_MONITOR_TEMPERATURE);

        /* 判断温度数据是否有效 */
        if((usRegVal & 0x8000) != 0)
        {
            /* 温度数据有效 */
            bValid = true;

            /* 计算温度*/
            usTemp = (usRegVal & 0x07F0)>>4;
            ucIndex = usRegVal & 0x000F;
            fTemp = fTempFractionalValue[ucIndex] + (float_t) usTemp;

            if((usRegVal & 0x0800) != 0)
            {
                /* 温度为负 */
                fTemp = fTemp * (-1.0);
            }

            *pfTemp = fTemp;
        }
        else
        {
            bValid = false;
        }

        *bpValid = bValid;

        bRet = true;
    }

    return bRet;
}


/*
***********************************************************************************************************************
* 函数名称: GetSwitchKeyPos
*
* 功能描述: 获取钥匙开关状态
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 钥匙开关状态（run/stop/prog/init）
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint16_t GetSwitchKeyPos(void)
{
    uint16_t usRegVal = 0;
    uint16_t usKeyPos = 0;

    usRegVal = fpga_read(REG_SWITCH_KEY);
    usKeyPos = (usRegVal & 0x07);

    return usKeyPos;
}

/*
***********************************************************************************************************************
* 函数名称: Get24Volt1AlarmBit
*
* 功能描述: 获取24v1报警位
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 故障/正常
*
* 注意事项: 无
***********************************************************************************************************************
*/
Alarm_t Get24Volt1AlarmBit(void)
{
    uint16_t usRegVal = 0;
    Alarm_t emAlarmBit = ALARM_BIT_OK;

    usRegVal = fpga_read(REG_MONITOR_STATE);
    emAlarmBit = (Alarm_t)((usRegVal & 0x02)>>1);

    return emAlarmBit;
}

/*
***********************************************************************************************************************
* 函数名称: Get24Volt2AlarmBit
*
* 功能描述: 获取24v2报警位
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 故障/正常
*
* 注意事项: 无
***********************************************************************************************************************
*/
Alarm_t Get24Volt2AlarmBit(void)
{
    uint16_t usRegVal = 0;
    Alarm_t emAlarmBit = ALARM_BIT_OK;

    usRegVal = fpga_read(REG_MONITOR_STATE);
    emAlarmBit = (Alarm_t)((usRegVal & 0x04)>>2);

    return emAlarmBit;
}

/*
***********************************************************************************************************************
* 函数名称: GetBatteryAlarmBit
*
* 功能描述: 获取电池报警位
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 故障/正常
*
* 注意事项: 无
***********************************************************************************************************************
*/
Alarm_t GetBatteryAlarmBit(void)
{
    uint16_t usRegVal = 0;
    Alarm_t emAlarmBit = ALARM_BIT_OK;

    usRegVal = fpga_read(REG_MONITOR_STATE);
    emAlarmBit = (Alarm_t)(usRegVal & 0x01);

    return emAlarmBit;
}

/*
***********************************************************************************************************************
* 函数名称: UpdateStateLED
*
* 功能描述: 更新状态灯寄存器
*
* 输入参数: usState:待更新内容
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void UpdateStateLED(uint16_t usState)
{
    fpga_write(REG_CONTROL_STATE_LED, usState);

    return;
}

/*
***********************************************************************************************************************
* 函数名称: UpdateKeyLED
*
* 功能描述: 更新钥匙灯寄存器
*
* 输入参数: usState:待更新内容
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void UpdateKeyLED(uint16_t usState)
{
    fpga_write(REG_CONTROL_KEY_LED, usState);

    return;
}

/*
***********************************************************************************************************************
* 函数名称: UpdateComLED
*
* 功能描述: 更新通讯灯寄存器
*
* 输入参数: usState:待更新内容
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void UpdateComLED(uint16_t usState)
{
    fpga_write(REG_CONTROL_COM_LED, usState);

    return;
}

/*
***********************************************************************************************************************
* 函数名称: SetLocalPMAddr
*
* 功能描述: 设置本机PM地址
*
* 输入参数: iTimeout 超时
*
* 输出参数: 无
*
* 返 回 值  : 设置成功或失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SetLocalPMAddr(int32_t iTimeout)
{
    bool_t bRet = false;
    uint16_t usRegVal = 0;
    uint16_t usAddrA = 0;
    uint16_t usAddrB = 0;

    do
    {
        usRegVal = fpga_read(REG_SLOT_ADDR);
        if(((usRegVal&0x80) == 0x80) && ((usRegVal&0x8000) == 0x8000))
        {
            usAddrA = (usRegVal&0x03);
            usAddrB = ((usRegVal>>8)&0x03);

            if(usAddrA == usAddrB)
            {
                fpga_write(REG_STATION_ADDR, usAddrA);
            }
            bRet = true;
            break;
        }

        if(iTimeout > 0)
        {
            iTimeout--;
        }

    }while(iTimeout > 0);

    return bRet;
}
/*
***********************************************************************************************************************
* 函数名称: GetLocalPMAddr
*
* 功能描述: 获取PM地址
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : PM的地址
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint16_t GetLocalPMAddr(void)
{
    uint16_t usRegVal = 0;
    uint16_t usAddr = 0;

    usRegVal = fpga_read(REG_SLOT_ADDR);
    usAddr = (usRegVal&0x03);

    return usAddr;
}

/*
***********************************************************************************************************************
* 函数名称: SysGetSyncTimeLow32
*
* 功能描述: 获取同步时间
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 低32位时间
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SysGetSyncTimeLow32(void)
{
    uint16_t usRegValLow1 = 0;       /*bit0~15*/
    uint16_t usRegValLow2 = 0;       /*bit0~15*/
    uint16_t usRegValHigh = 0;      /* bit16~31 */
    uint32_t uiSyncTime1 = 0;
    uint32_t uiSyncTime2 = 0;
    uint32_t uiSyncTime = 0;

    /* 读取一次 */
    usRegValLow1 = fpga_read(REG_SYNC_TIME1);
    usRegValHigh = fpga_read(REG_SYNC_TIME2);

    uiSyncTime1 = (uint32_t)usRegValHigh;
    uiSyncTime1 = (uiSyncTime1<<16);
    uiSyncTime1 += (uint32_t)usRegValLow1;

    /* 再读取一次 */
    usRegValLow2 = fpga_read(REG_SYNC_TIME1);
    usRegValHigh = fpga_read(REG_SYNC_TIME2);

    uiSyncTime2 = (uint32_t)usRegValHigh;
    uiSyncTime2 = (uiSyncTime2<<16);
    uiSyncTime2 += (uint32_t)usRegValLow2;

    /* 若低16位溢出则用第二次读取的值，否则用第一次读取的值 */
    if(usRegValLow1 > usRegValLow2)
    {
        uiSyncTime = uiSyncTime2;
    }
    else
    {
        uiSyncTime = uiSyncTime1;
    }

    return uiSyncTime;
}

/*
***********************************************************************************************************************
* 函数名称: SysGetSyncTimeHigh16
*
* 功能描述: 获取同步时间
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 高16位时间
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint16_t SysGetSyncTimeHigh16(void)
{
    uint16_t usRegVal = 0;       /*bit32~47*/

    usRegVal = fpga_read(REG_SYNC_TIME3);

    return usRegVal;
}
/*
***********************************************************************************************************************
* 函数名称: SysGetSyncTimeState
*
* 功能描述: 获取同步时间状态
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 32位时间
*
* 注意事项: "Bit0：0：同步校准未完成，1：同步校准已完成"
***********************************************************************************************************************
*/
uint16_t SysGetSyncTimeState(void)
{
    uint16_t usRegVal = 0;

    usRegVal = fpga_read(REG_SYNC_TIME_STATE);

    return usRegVal;
}

/*
***********************************************************************************************************************
* 函数名称: SysSetSyncAdjustTimeLow32
*
* 功能描述: 设置同步校时时间
*
* 输入参数: 低32位时间
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysSetSyncAdjustTimeLow32(uint32_t uiAdjustTime)
{
    uint16_t usRegVal = 0;

    usRegVal = (uint16_t)(uiAdjustTime);
    fpga_write(REG_SYNC_ADJUST_TIME1, usRegVal);

    usRegVal = (uint16_t)(uiAdjustTime >> 16);
    fpga_write(REG_SYNC_ADJUST_TIME2, usRegVal);

    fpga_write(REG_SYNC_ADJUST_TIME3, 0);

    return ;
}
/*
***********************************************************************************************************************
* 函数名称: SysSetSyncAdjustTimeHigh16
*
* 功能描述: 设置同步校时时间
*
* 输入参数: 高16位时间
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysSetSyncAdjustTimeHigh16(uint16_t usAdjustTime)
{
    fpga_write(REG_SYNC_ADJUST_TIME3, usAdjustTime);

    return ;
}
/*
***********************************************************************************************************************
* 函数名称: SysSetSyncAdjustTimeEnable
*
* 功能描述: 设置同步校时时间使能
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysSetSyncAdjustTimeEnable(void)
{
    uint16_t usRegVal = 1; /* "Bit0:0：无效，1：使能同步校准" */

    fpga_write(REG_SYNC_ADJUST_TIME_ENABLE, usRegVal);

    return ;
}

/*
***********************************************************************************************************************
* 函数名称: SysGetModularOnLine
*
* 功能描述: 模块在线状态
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 在线状态
*
* 注意事项: "Bit1：对模块2主备状态。0：未在线，1：在线"
*         "Bit0：对模块1主备状态。0：未在线，1：在线"
***********************************************************************************************************************
*/
uint16_t SysGetModularOnLine(void)
{
    uint16_t usRegVal = 0;

    usRegVal = fpga_read(REG_MODULAR_ON_LINE);

    return usRegVal;
}

/*
***********************************************************************************************************************
* 函数名称: SysSetTimerMasterEnable
*
* 功能描述: 设置升主使能
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 在线状态
*
* 注意事项: 写入0xA5A5指示升主使能，写入0x5A5A指示降备使能，写入其他值无效。
* 
***********************************************************************************************************************
*/
void SysSetTimerMasterEnable(uint16_t usRegVal)
{

    fpga_write(REG_MAIN_ENABLE,usRegVal);

    return;
}
/*
***********************************************************************************************************************
* 函数名称: SysSetSWRuninOK
*
* 功能描述: 设置软件运行OK
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 在线状态
*
* 注意事项: 写入0xA5A5指示软件运行OK，写入其他值指示软件NOK。
* 
***********************************************************************************************************************
*/
void SysSetSWRuninOK(uint16_t usRegVal)
{

    fpga_write(REG_SW_RUNING_OK,usRegVal);

    return;
}

/*
***********************************************************************************************************************
*                                局部函数实现
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/
