/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    :
*
*  文件名称    :
*
*  功能简介    :
*
*  作者            : 李琦
*
*  创建日期    :
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include <Srv/Scheduler/include/stdio.h>
#include "Srv/SysResource/inc/Sys.h"
#include "inc/DataType.h"
#include "../inc/CMTable.h"
/*
***********************************************************************************************************************
*                                局部变量声明
***********************************************************************************************************************
*/
static SysCMTable_t s_stCMTable;



/*
***********************************************************************************************************************
*                                局部函数声明
***********************************************************************************************************************
*/
static CMController_t FindNotUsedCMLogicID(void);

/*
***********************************************************************************************************************
*                                全局函数实现
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: CMTableInit
*
* 功能描述: 初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CMTableInit(void)
{
    uint8_t i = 0;

    /* 初始化有效标识及槽号*/
    for(i = 0; i < NUM_OF_SLOT; i++)
    {
        s_stCMTable.bValid[i] = false;
        s_stCMTable.ucLogicID[i] = INVALID_CM_ID;
    }

    return;
}


/*
***********************************************************************************************************************
* 函数名称: UpdateCMTable
*
* 功能描述:
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void UpdateCMTable(void)
{
    uint8_t i = 0;

    for(i = SLOT3; i < NUM_OF_SLOT; i++)
    {
        if(true == s_bCM_slot_table[i])
        {
            if(false == s_stCMTable.bValid[i])
            {
                s_stCMTable.ucLogicID[i] = FindNotUsedCMLogicID();
    
                if(s_stCMTable.ucLogicID[i] != INVALID_CM_ID)
                {
                    //printf("CM logic id= %d\n",s_stCMTable.ucLogicID[i]);
                    s_stCMTable.bValid[i] = true;
                }
            }
        }
        else
        {
            s_stCMTable.ucLogicID[i] = INVALID_CM_ID;
            s_stCMTable.bValid[i] = false;
        }
        //printf("s_bCM_slot_table[%d]=%d\n",i,s_bCM_slot_table[i]);
    }

    return;
}

/*
***********************************************************************************************************************
* 函数名称: CMLogicIDToSLotID
*
* 功能描述: 逻辑号转槽号
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMSlot_t CMLogicIDToSLotID(CMController_t emCMID)
{
    CMSlot_t emCMSlot = INVALID_CM_SLOT;
    uint8_t i = 0;

    for(i = SLOT3; i < NUM_OF_SLOT; i++)
    {
        /* 由逻辑号查找槽号 */
        if((emCMID == s_stCMTable.ucLogicID[i])&&(s_stCMTable.bValid[i] == true))
        {
//            printf("cm slot =%d\n",i);
            emCMSlot = i;
            break;
        }
    }
    return emCMSlot;
}

/*
***********************************************************************************************************************
* 函数名称: CMSLotIDToLogicID
*
* 功能描述: 槽号转逻辑号
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMController_t CMSLotIDToLogicID(CMSlot_t emCMSlot)
{
    uint8_t i = emCMSlot;
    CMController_t emCMID = INVALID_CM_ID;

    /* 由槽号查逻辑号 */
    if(s_stCMTable.bValid[i] == true)
    {
        emCMID = s_stCMTable.ucLogicID[i];
//        printf("cm logic id =%d\n",emCMID);
    }

    return emCMID;
}

/*
***********************************************************************************************************************
*                                局部函数实现
***********************************************************************************************************************
*/

static CMController_t FindNotUsedCMLogicID(void)
{
    CMSlot_t i = SLOT3;
    CMController_t j = INVALID_CM_ID;
    CMController_t emRet = INVALID_CM_ID;
    bool_t bUsed = false;

    for(j=CM1;j<NUM_OF_CM;j++)
    {
        for(i=SLOT3;i<NUM_OF_SLOT;i++)
        {
            if(s_stCMTable.ucLogicID[i] == j)
            {
                emRet = INVALID_CM_ID;
                bUsed = true;
                break;
            }
            else
            {
                bUsed = false;
            }
            //printf("j=%d  logic_id[%d]=%d  ",j, i, s_stCMTable.ucLogicID[i]);
            //printf("\n");
        }

        if(false == bUsed )
        {
            emRet = j;
            break;
        }
    }

    return emRet;
}


/*
***********************************************************************************************************************
*                                局部函数实现
***********************************************************************************************************************
*/




/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/


