/*
 ***********************************************************************************************************************
 *                  Copyright(c) 北京康吉森技术有限公司 2015
 *           Beijing Consen Technologies Co.,Ltd. All rights reserved.
 *
 *
 *  项目名称    : 安全控制系统
 * 
 *  模块名称    : 任务层模块
 *
 *  文件名称    : main.c
 *
 *  功能简介    : 创建主任务和校时任务
 *
 *  作者       : 李琦
 *
 *  创建日期    : 2015-12-30
 *
 *  版本信息    : V1.0
 *
 *  修订信息    : 无
 *
 ***********************************************************************************************************************
 */

/*
 ***********************************************************************************************************************
 *                                包含头文件
 ***********************************************************************************************************************
 */
#include <stdio.h>
#include <stdlib.h>
#include <sys/types.h>
#include <unistd.h>
#include <sys/wait.h>
#include <pthread.h>
#include <string.h>
#include <errno.h>
#include <ctype.h>
#include <sched.h>
#include <unistd.h>
#include <sys/time.h>
#include <sys/resource.h>
#include "../inc/main.h"

/*
 ***********************************************************************************************************************
 *                                全局变量声明
 ***********************************************************************************************************************
 */
pid_t MainID = -1;
pid_t TimingID = -1;

/*
 ***********************************************************************************************************************
 *                                局部变量声明
 ***********************************************************************************************************************
 */

/*
 ***********************************************************************************************************************
 *                                局部函数声明
 ***********************************************************************************************************************
 */
/* Catch signal "ctrl+c" */
//static int sig_catch(void);

/*
 ***********************************************************************************************************************
 *                                全局函数实现
 ***********************************************************************************************************************
 */




/*
 ***********************************************************************************************************************
 * 函数名称: main
 *
 * 功能描述: main函数
 *
 * 输入参数: 无
 *
 * 输出参数: 无
 *
 * 返 回 值: 无
 *
 * 注意事项: 无
 ***********************************************************************************************************************
 */
int main(void) 
{
    MainID = fork();

    if (-1 == MainID) 
    {
        printf("Main task fork error.\n");
        exit(1);
    }
    else if (0 == MainID) 
    {
        int prio_process;
        int errno, prio=-5;//-5

        prio_process = getpriority(PRIO_PROCESS, MainID);
        printf("Process (%d) Priority is %d.\n", MainID, prio_process);
        errno = setpriority(PRIO_PROCESS, MainID, prio);
        printf("Main task start to run.\n");
        
        TskMainTask();
    }

#if 1
    TimingID = fork();
    if (-1 == TimingID) 
    {
        printf("Timing task fork error.\n");
        exit(1);
    }
    else if (0 == TimingID) 
    {
        int prio_process;
        int errno, prio=-6;//-6

        prio_process = getpriority(PRIO_PROCESS, TimingID);
        printf("Timing Process (%d) Priority is %d.\n", TimingID, prio_process);
        errno = setpriority(PRIO_PROCESS, TimingID, prio);
        printf("Timing task start to run.\n");
        TskTimingTask();
    }
#endif
    /* catch "ctrl+c" */
    //sig_catch();
    //while(1);

    return 0;
}

/*
 ***********************************************************************************************************************
 *                                局部函数实现
 ***********************************************************************************************************************
 */
#if 0
/* The following functions are just for debugging, and they will be deleted in future */
static void my_handler(int sig)
{
    printf("sig %d\n",sig);
    system("pkill RTS");
    exit(EXIT_SUCCESS);
}

static int sig_catch(void)
{
    if(signal(SIGINT,my_handler) == SIG_ERR) 
    {
        perror("register signal fail ");
        exit(-1);
    }

    char *msg={"abcd"};
    psignal(SIGINT,msg);
    //printf("sig:%s",strsignal(SIGINT));

    return 0;
}
#endif
/*
 ***********************************************************************************************************************
 文件结束
 ***********************************************************************************************************************
 */
