/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
* 
*  模块名称    : 
*
*  文件名称    : Diag.c
*
*  功能简介    : 
*
*  作者          : 李琦
*
*  创建日期    : 2016-11-22
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "../inc/Diag.h"
#include "Srv/Diag/inc/BoardDiag.h"
#include "Srv/SharedMem/inc/SharedMem.h"

/*
***********************************************************************************************************************
*                                局部变量声明
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
*                                局部函数声明
***********************************************************************************************************************
*/
static void PassOrFailLEDUpdate(void);




/*
***********************************************************************************************************************
*                                全局函数实现
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: DiagInit
*
* 功能描述: 初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void DiagInit(void)
{

    Core1DiagInit();
    Core1DiagPowerOn();
    PassOrFailLEDUpdate();
}

/*
***********************************************************************************************************************
* 函数名称: DiagCycle
*
* 功能描述: 周期运行函数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void DiagCycle(void)
{
    Core1DiagCycle();
    PassOrFailLEDUpdate();
}


/*
***********************************************************************************************************************
*                                局部函数实现
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: PassOrFailLEDUpdate
*
* 功能描述: 刷新pass和fault状态灯
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
static void PassOrFailLEDUpdate(void)
{
    /* 获取诊断控制信息地址指针 */
    DiagCtrlInfo_t * pstThis = NULL;
    uint32_t uiVecFlag = FALSE;

    pstThis= DiagCommGetDiagCtrlInfo();

    if(MASK_SETALL != pstThis->uiCodeDiagVec)
    {/* 代码自检失败 */
        BoardDiagErrHandle(TEST_FAILED,ERR_SYSCODE_A_TESTFAILED, 0, "code test failed");
        uiVecFlag = FALSE;
    }
    else if(MASK_SETALL != pstThis->uiCPUDiagVec)
    {/* CPU类自检失败 */
        uiVecFlag = FALSE;
        BoardDiagErrHandle(TEST_FAILED,ERR_TEST_CPU_UNKNOWN, 0, "CPU test failed");
    }
    else if(MASK_SETALL != pstThis->uiRamDiagVec)
    {/* RAM自检失败   */
        uiVecFlag = FALSE;
        BoardDiagErrHandle(TEST_FAILED,ERR_SYSRAM_A_TESTFAILED, 0 ,"RAM test failed");
    }
    else if(MASK_SETALL != pstThis->uiExceptionDiagVec)
    {/* 异常自检失败  */
        uiVecFlag = FALSE;
        BoardDiagErrHandle(TEST_FAILED,ERR_EXCPTTEST_FAILED, 0, "Exception test failed");
    }
    else
    {
        uiVecFlag = TRUE;
    }

    if(TRUE == uiVecFlag)
    {
        /* diag pass */
        SetLEDState(LED_NAME_PASS, LED_ON);
    }
    else
    {
        /* diag fail */
        SetLEDState(LED_NAME_PASS, LED_OFF);
        /* fault LED指示状态灯操作 */
        SetLEDState(LED_NAME_FAULT, LED_ON);

        DiagCommSetCore1FailFlag();
    }
}


/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/
