/*
***********************************************************************************************************************
*                  Copyright(c) 鍖椾含搴峰悏妫妧鏈湁闄愬叕鍙� 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  椤圭洰鍚嶇О    : 瀹夊叏鎺у埗绯荤粺
*
*  妯″潡鍚嶇О    : CM閰嶇疆妯″潡
*
*  鏂囦欢鍚嶇О    : CM_Config.h
*
*  鍔熻兘绠�浠�    : 瀹屾垚CM鐩稿叧閰嶇疆淇℃伅鐨勮姹傚拰瑙ｆ瀽
*
*  浣滆��           : 鍒橀槼
*
*  鍒涘缓鏃ユ湡    : 2016-03-11
*
*  鐗堟湰淇℃伅    : V1.0
*
*  淇淇℃伅    : 鏃�
*
***********************************************************************************************************************
*/
#ifndef CM_CONFIG_H_
#define CM_CONFIG_H_

/*
***********************************************************************************************************************
*                                鍖呭惈澶存枃浠�
***********************************************************************************************************************
*/
#include "Sys/inc/DataType.h"
#include "Sys/inc/CMconfig.h"
#include "Sys/inc/SysConfig.h"
#include "Sys/inc/SysTmp.h"
#include "Sys/inc/SysPCsoftware.h"

/*
***********************************************************************************************************************
*                                瀹忓畾涔�
***********************************************************************************************************************
*/
#define DEBUG_OUT_CONFIG
#ifdef DEBUG_OUT_CONFIG
#define DEBUG_CONFIG(format, args...)  printf ("D_CONFIG: ") ; printf(format, ##args)
#else
#define DEBUG_CONFIG(format, args...)
#endif



#define SYS_INIT_DOWNLOAD                       (0x01)
#define SYS_ONLINE_DOWNLOAD                     (0x02)

#define MOD_NOT_ONLINE                          (0x00)
#define MOD_ONLINE                              (0x01)

#define MAX_INTERCMD_DATA_LEN                   (1024U)

#define CONFIG_VERN_DIFFER                      (0x01)          /*PM工程使用版本与本地CM工程版本不一致*/

#define CONFIG_DOWNLOAD_VERN_DIFFER             (0x02)          /*在线下装情况下，下装工程版本与本地CM工程版本不一致*/

#define RECV_CONFIGINFO_DONE                    (0x01)

#define HAS_NEW_MODBUS_MASTER_CONFIG            (0x01)

#define HAS_NEW_MODBUS_SLAVE_CONFIG             (0x02)

#define HAS_NEW_CM_CONFIG                       (0x03)

#define HAS_NEW_OPC_CONFIG                      (0x04)

#define HAS_NEW_CTRL_STATION_CONFIG             (0x05)

#define HANDLE_OK                               (1)
#define HANDLE_FAIL                             (-1)


#define RET_OK                                  (0)           /* 公共返回值 ---OK             */
#define RET_FAIL                                (-1)          /* 公共返回值 ---fail           */

/*
***********************************************************************************************************************
*                                鏁版嵁缁撴瀯瀹氫箟
***********************************************************************************************************************
*/
typedef enum
{
    FREE= 0x00,
    BUSY
}Service_Handle_Flag_t;


typedef enum
{
    CMD_NONE = 0x00,
    CMD_REQ_ALL_CMCONFIG,
    CMD_REQ_INCRE_CMCONFIG
}InterCMD_t;



typedef struct InterCMDHeadTag
{
    PMController_t emPMID;
    CMSlot_t emCMSlotID;
    InterCMD_t emInterCMD;
}InterCMDHead_t;



/*
***********************************************************************************************************************
*                                鍏ㄥ眬鍑芥暟澹版槑
***********************************************************************************************************************
*/
/*
********************************函数描述*******************************************************************************
* 函数名称: CMConfigInit
*
* 功能描述: 模块初始化函数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CMConfigInit(void);

/*
********************************函数描述*******************************************************************************
* 函数名称: CMConfigCycle
*
* 功能描述: 模块周期执行函数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CMConfigCycle(void);

#endif /*CM_CONFIG_H_*/

/*
***********************************************************************************************************************
                                 鏂囦欢缁撴潫
***********************************************************************************************************************
*/
