/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    :
*
*  文件名称    : CodeTest.h
*
*  功能简介    :
*
*  作者            : 李琦
*
*  创建日期    : 2016-11-14
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/
#ifndef _CODETEST_H
#define _CODETEST_H

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "Srv/Diag/inc/Diagcommon.h"
/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/
#define CODE_CRC_STEP       (0x100U)                       /* 代码CRC计算步进距离               */
#define PRJ_CRC_STEP        (0x100U)                       /* IEC工程代码CRC计算步进距离        */

#define CODE_MIN_STEP_SIZE  (4U)                           /* 代码自检最小步进距离  */

#define RTS_CODE_A          (0U)
#define RTS_CODE_B          (1U)

#define NUM_OF_RTS_CODE     (2U)                           /* bin总数                           */

#define RTS_CODE_A_OFFSET_ADDR              (0x04EAF000)                  /* BIN在DDR中起始地址 */
#define RTS_CODE_A_CONTENT_OFFSET_ADDR      (0x04EAF080)
#define RTS_CODE_B_OFFSET_ADDR              (0x00EAF000)                  /* BIN在DDR中起始地址 */
#define RTS_CODE_B_CONTENT_OFFSET_ADDR      (0x00EAF080)


/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/
typedef struct RtsCodeHeaderTag
{
    uint8_t ucCRC[8];
    uint8_t ucRes1;
    uint8_t ucSize[7];
    uint8_t ucRes2;
}RtsCodeHeader_t;

typedef struct RtsCodeTag
{
    uint32_t uiStartAddr;
    uint32_t uiCodeSize;
    uint32_t uiCRC;
}RtsCode_t;

typedef struct PrjCodeTag
{
    uint32_t uiStartAddr;
    uint32_t uiCodeSize;
    uint32_t uiCRC;
}PrjCode_t;


/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: CodeTestInit
*
* 功能描述: 代码自检初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CodeTestInit(void);

/*
***********************************************************************************************************************
* 函数名称: CodeTestCycle
*
* 功能描述: 代码自检管理函数，完成代码分片计算CRC的整个过程调度。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CodeTestCycle(puint32_t puiVectorTest);

#endif/* #ifndef _CODETEST_H */
