/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 工程配置模块
*
*  文件名称    : CMconfig.h
*
*  功能简介    : 完成对工程文件的配置
*
*  作者           : 刘阳
*
*  创建日期    : 2015-12-30
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include <string.h>
#include "../inc/CMconfig.h"

/*
***********************************************************************************************************************
*                                局部变量声明
***********************************************************************************************************************
*/

static CtrlStationConfigInfo_t s_stCtrlStationCfg;
static ModbusMasterInfo_t s_stModbusMasterCfg;
static ModbusSlaveInfo_t s_stModbusSlaveCfg;
static OPCVarInfo_t s_stOPCCfg;
static CMConfigInfo_t s_stCMCfg;
static CMSlotIdTabl_t s_stCMSlotIdTablCfg;
/*
***********************************************************************************************************************
*                                局部函数声明
***********************************************************************************************************************
*/





/*
***********************************************************************************************************************
*                                全局函数实现
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: CMCfgInit
*
* 功能描述: 配置信息结构初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CMCfgInit(void)
{
    memset(&s_stCtrlStationCfg, 0x00, sizeof(CtrlStationConfigInfo_t));
    memset(&s_stModbusMasterCfg, 0x00, sizeof(ModbusMasterInfo_t));
    memset(&s_stModbusSlaveCfg, 0x00, sizeof(ModbusSlaveInfo_t));
    memset(&s_stOPCCfg, 0x00, sizeof(OPCVarInfo_t));
    memset(&s_stCMCfg, 0x00, sizeof(CMConfigInfo_t));
    memset(&s_stCMSlotIdTablCfg, 0x00, sizeof(CMSlotIdTabl_t));

    return;
}
/*
***********************************************************************************************************************
* 函数名称: CMCfgGetCtrlStationInfo
*
* 功能描述: 获取控制站配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CtrlStationConfigInfo_t* CMCfgGetCtrlStationInfo(void)
{
    CtrlStationConfigInfo_t* pstConfigInfo = NULL;

    pstConfigInfo = (CtrlStationConfigInfo_t*)&s_stCtrlStationCfg;

    return pstConfigInfo;
}
/*
***********************************************************************************************************************
* 函数名称: CMCfgGetModbusMasterInfo
*
* 功能描述: 获取Modbus主配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ModbusMasterInfo_t* CMCfgGetModbusMasterInfo(void)
{
    ModbusMasterInfo_t* pstConfigInfo = NULL;

    pstConfigInfo = (ModbusMasterInfo_t*)&s_stModbusMasterCfg;

    return pstConfigInfo;
}
/*
***********************************************************************************************************************
* 函数名称: CMCfgGetModbusSlaveInfo
*
* 功能描述: 获取Modbus从配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ModbusSlaveInfo_t* CMCfgGetModbusSlaveInfo(void)
{
    ModbusSlaveInfo_t* pstConfigInfo = NULL;

    pstConfigInfo = (ModbusSlaveInfo_t*)&s_stModbusSlaveCfg;

    return pstConfigInfo;
}
/*
***********************************************************************************************************************
* 函数名称: CMCfgGetOPCVarInfo
*
* 功能描述: 获取OPC配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
OPCVarInfo_t* CMCfgGetOPCVarInfo(void)
{
    OPCVarInfo_t* pstConfigInfo = NULL;

    pstConfigInfo = (OPCVarInfo_t*)&s_stOPCCfg;

    return pstConfigInfo;
}
/*
***********************************************************************************************************************
* 函数名称: CMCfgGetCMConfigInfo
*
* 功能描述: 获取CM配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMConfigInfo_t* CMCfgGetCMConfigInfo(void)
{
    CMConfigInfo_t* pstConfigInfo = NULL;

    pstConfigInfo = (CMConfigInfo_t*)&s_stCMCfg;

    return pstConfigInfo;
}
/*
***********************************************************************************************************************
* 函数名称: CMCfgGetCMSlotIdTabl
*
* 功能描述: 获取CM槽位号与CM ID对照表信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMSlotIdTabl_t* CMCfgGetCMSlotIdTabl(void)
{
    CMSlotIdTabl_t* pstConfigInfo = NULL;

    pstConfigInfo = (CMSlotIdTabl_t*)&s_stCMSlotIdTablCfg;

    return pstConfigInfo;
}


/*
***********************************************************************************************************************
*                                局部函数实现
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称:
*
* 功能描述:
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项:
***********************************************************************************************************************
*/





/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/
