/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 共享安全通讯
*
*  文件名称    : SharedSafetyComm.h
*
*  功能简介    : core0与core1间的共享安全通讯状态
*
*  作者            : 李琦
*
*  创建日期    : 2016-04-27
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef SHARED_SAFETYCOMM_H_
#define SHARED_SAFETYCOMM_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/

#include "inc/DataType.h"
#include "inc/Hardware.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/

#define MAX_STATION_CNT   (64)    /* 控制站的最大数目 */
#define MIN_STA_ID        (1)     /* 站ID的最小值 */
#define MAX_STA_ID        (64)    /* 站ID的最大值 */
#define MAX_IO_MODULE_CNT (236)   /* IO模块的最大数目 */

/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/

/* PM ID PMID枚举定义 */
typedef enum SysPMIDTag
{
    PM_A = 0x00U,
    PM_B,
    PM_C,
    PM_NUM,
    PM_INVALID
}SysPMID_t;


/****************************** P2P Safety ******************************/
/* System P2P Receive Request Communication Info. 接收站：接收请求帧通讯信息结构体定义 */
typedef struct SysP2PRecvReqCommInfoTag
{
    bool_t bTolFlag;       /* Tolerance Flag  容忍标志位 */
    bool_t bErrFlag;       /* Error Flag      错误标志位 */
    uint8_t ucReserve[2];  /* Reserve         预留 */
}SysP2PRecvReqCommInfo_t;

/* System P2P Send Request Communication Info. 发送站：发送请求帧通讯信息结构体定义 */
typedef struct SysP2PSendReqCommInfoTag
{
    bool_t bTolFlag;       /* Tolerance Flag     容忍标志位 */
    bool_t bErrFlag;       /* Error Flag         错误标志位 */
    bool_t bSendTimeout;   /* Send Timeout Flag  发送请求帧超时标志位 */
    uint8_t ucReserve;     /* Reserve            预留 */
}SysP2PSendReqCommInfo_t;


/****************************** PM Safety ******************************/
/* System PM Receive Info.  接收方：接收信息结构体定义 */
typedef struct SysPMRecvInfoTag
{
    bool_t bTolFlag;       /* Tolerance Flag  容忍标志位 */
    bool_t bErrFlag;       /* Error Flag      错误标志位 */
    uint8_t ucReserve[2];  /* Reserve         预留 */
}SysPMRecvInfo_t;

/* System PM Send Info.     发送方：发送信息结构体定义 */
typedef struct SysPMSendInfoTag
{
    bool_t bSendTimeout;   /* Send Timeout Flag  发送超时标志位 */
    uint8_t ucReserve[3];  /* Reserve            预留 */
}SysPMSendInfo_t;


/****************************** PM IO Safety ******************************/
/* System PM I/O Communication Info  PM与I/O模块通信信息结构体定义 */
typedef struct SysPMIOCommInfoTag
{
    bool_t bTolFlag;       /* Tolerance Flag                  容忍标志位 */
    bool_t bErrFlag;       /* Error Flag                      错误标志位 */
    bool_t bSendTimeout;   /* Send Timeout Flag               发送超时标志位 */
    bool_t bFailure;       /* Failure Flag                    I/O模块存在失效标志位 */
    bool_t bFVActived;     /* Fail-safe Values (FV) Activated 从站使用故障安全值标志位 */
    bool_t bNewIPara;      /* New i-Parameter OK              从站采用主站下发的新参数标志位 */
    uint8_t ucReserve[2];  /* Reserve                         预留 */
}SysPMIOCommInfo_t;

/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: SharedSafetyCommInit
*
* 功能描述: 初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SharedSafetyCommInit( void );

/*
***********************************************************************************************************************
* 函数名称: SysSetPMID
*
* 功能描述: 设置本系PMID
*
* 输入参数: emPMID：PM模块ID
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetPMID( SysPMID_t emPMID );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMID
*
* 功能描述: 获取本系PMID
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 本系PMID
*
* 注意事项: 无
***********************************************************************************************************************
*/

SysPMID_t SysGetPMID( void );

/*
***********************************************************************************************************************
* 函数名称: SysSetStationID
*
* 功能描述: 设置本控制站ID
*
* 输入参数: ucStationID：控制站ID
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetStationID( uint8_t ucStationID );

/*
***********************************************************************************************************************
* 函数名称: SysGetStationID
*
* 功能描述: 获取本控制站ID
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 本控制站ID
*
* 注意事项: 无
***********************************************************************************************************************
*/

uint8_t SysGetStationID( void );

/*
***********************************************************************************************************************
* 函数名称: SysSetTolCnt
*
* 功能描述: 设置容忍次数
*
* 输入参数: ucTolCnt：容忍次数
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetTolCnt( uint8_t ucTolCnt );

/*
***********************************************************************************************************************
* 函数名称: SysGetTolCnt
*
* 功能描述: 获取容忍次数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 容忍次数
*
* 注意事项: 无
***********************************************************************************************************************
*/

uint8_t SysGetTolCnt( void );

/*
***********************************************************************************************************************
* 函数名称: SysSetP2PRecvTolFlag
*
* 功能描述: 设置P2P接收容忍标志位
*
* 输入参数: ucSrcStaIndex：源（数据发送方）控制站索引值；
*          bTolFlag：容忍标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetP2PRecvTolFlag( uint8_t ucSrcStaIndex, bool_t bTolFlag );

/*
***********************************************************************************************************************
* 函数名称: SysGetP2PRecvTolFlag
*
* 功能描述: 获取P2P接收容忍标志位
*
* 输入参数: ucSrcStaIndex：源（数据发送方）控制站索引值
*
* 输出参数: 无
*
* 返 回 值  : 容忍标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetP2PRecvTolFlag( uint8_t ucSrcStaIndex );

/*
***********************************************************************************************************************
* 函数名称: SysSetP2PRecvErrFlag
*
* 功能描述: 设置P2P接收错误标志位
*
* 输入参数: ucSrcStaIndex：源（数据发送方）控制站索引值；
*          bErrFlag：错误标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetP2PRecvErrFlag( uint8_t ucSrcStaIndex, bool_t bErrFlag );

/*
***********************************************************************************************************************
* 函数名称: SysGetP2PRecvErrFlag
*
* 功能描述: 获取P2P接收错误标志位
*
* 输入参数: ucSrcStaIndex：源（数据发送方）控制站索引值
*
* 输出参数: 无
*
* 返 回 值  : 错误标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetP2PRecvErrFlag( uint8_t ucSrcStaIndex );

/*
***********************************************************************************************************************
* 函数名称: SysGetP2PRecvReqCommInfo
*
* 功能描述: 获取源控制站对应的接收信息
*
* 输入参数: ucSrcStaIndex：源（数据发送方）控制站索引值
*
* 输出参数: pstRecvReqInfo：用于返回源控制站对应的接收信息
*
* 返 回 值  : 是否获取成功
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetP2PRecvReqCommInfo( uint8_t ucSrcStaIndex, SysP2PRecvReqCommInfo_t *pstRecvReqInfo );

/*
***********************************************************************************************************************
* 函数名称: SysSetP2PSendTolFlag
*
* 功能描述: 设置P2P发送容忍标志位
*
* 输入参数: ucDstStaIndex：目的（数据接收方）控制站索引值；
*          bTolFlag：容忍标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetP2PSendTolFlag( uint8_t ucDstStaIndex, bool_t bTolFlag );

/*
***********************************************************************************************************************
* 函数名称: SysGetP2PSendTolFlag
*
* 功能描述: 获取P2P发送错误标志位
*
* 输入参数: ucDstStaIndex：目的（数据接收方）控制站索引值
*
* 输出参数: 无
*
* 返 回 值  : 容忍标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetP2PSendTolFlag( uint8_t ucDstStaIndex );

/*
***********************************************************************************************************************
* 函数名称: SysSetP2PSendErrFlag
*
* 功能描述: 设置P2P发送错误标志位
*
* 输入参数: ucDstStaIndex：目的（数据接收方）控制站索引值；
*          bErrFlag：错误标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetP2PSendErrFlag( uint8_t ucDstStaIndex, bool_t bErrFlag );

/*
***********************************************************************************************************************
* 函数名称: SysGetP2PSendErrFlag
*
* 功能描述: 获取P2P发送错误标志位
*
* 输入参数: ucDstStaIndex：目的（数据接收方）控制站索引值
*
* 输出参数: 无
*
* 返 回 值  : 错误标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetP2PSendErrFlag( uint8_t ucDstStaIndex );

/*
***********************************************************************************************************************
* 函数名称: SysSetP2PSendTimeoutFlag
*
* 功能描述: 设置P2P发送超时标志位
*
* 输入参数: ucDstStaIndex：目的（数据接收方）控制站索引值；
*          bSendTimeout：超时标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetP2PSendTimeoutFlag( uint8_t ucDstStaIndex, bool_t bSendTimeout );

/*
***********************************************************************************************************************
* 函数名称: SysGetP2PSendTimeoutFlag
*
* 功能描述: 获取P2P发送超时标志位
*
* 输入参数: ucDstStaIndex：目的（数据接收方）控制站索引值
*
* 输出参数: 无
*
* 返 回 值  : 超时标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetP2PSendTimeoutFlag( uint8_t ucDstStaIndex );

/*
***********************************************************************************************************************
* 函数名称: SysGetP2PSendReqCommInfo
*
* 功能描述: 获取目的控制站对应的发送信息
*
* 输入参数: ucDstStaIndex：目的（数据接收方）控制站索引值
*
* 输出参数: pstSendReqInfo：用于返回目的控制站对应的发送信息
*
* 返 回 值  : 是否获取成功
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetP2PSendReqCommInfo( uint8_t ucDstStaIndex, SysP2PSendReqCommInfo_t *pstSendReqInfo );

/*
***********************************************************************************************************************
* 函数名称: SysSetPMRecvTolFlag
*
* 功能描述: 设置PM接收容忍标志位
*
* 输入参数: emSrcPMID：源（数据发送方）PMID；
*          bTolFlag：容忍标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetPMRecvTolFlag( SysPMID_t emSrcPMID, bool_t bTolFlag );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMRecvTolFlag
*
* 功能描述: 获取PM接收容忍标志位
*
* 输入参数: emSrcPMID：源（数据发送方）PMID；
*
* 输出参数: 无
*
* 返 回 值  : 容忍标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMRecvTolFlag( SysPMID_t emSrcPMID );

/*
***********************************************************************************************************************
* 函数名称: SysSetPMRecvErrFlag
*
* 功能描述: 设置PM接收错误标志位
*
* 输入参数: emSrcPMID：源（数据发送方）PMID；
*          bErrFlag：错误标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetPMRecvErrFlag( SysPMID_t emSrcPMID, bool_t bErrFlag );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMRecvErrFlag
*
* 功能描述: 获取PM接收错误标志位
*
* 输入参数: emSrcPMID：源（数据发送方）PMID
*
* 输出参数: 无
*
* 返 回 值  : 错误标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMRecvErrFlag( SysPMID_t emSrcPMID );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMRecvCommInfo
*
* 功能描述: 获取源PM模块对应的接收信息
*
* 输入参数: emSrcPMID：源（数据发送方）PMID
*
* 输出参数: pstRecvInfo：用于返回源PM对应的接收信息
*
* 返 回 值  : 是否获取成功
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMRecvCommInfo( SysPMID_t emSrcPMID, SysPMRecvInfo_t *pstRecvInfo );

/*
***********************************************************************************************************************
* 函数名称: SysSetPMSendTimeoutFlag
*
* 功能描述: 设置PM发送超时标志位
*
* 输入参数: emDstPMID：目的（数据接收方）PMID；
*          bSendTimeout：超时标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetPMSendTimeoutFlag( SysPMID_t emDstPMID, bool_t bSendTimeout );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMSendTimeoutFlag
*
* 功能描述: 获取PM发送超时标志位
*
* 输入参数: emDstPMID：目的（数据接收方）PMID
*
* 输出参数: 无
*
* 返 回 值  : 超时标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMSendTimeoutFlag( SysPMID_t emDstPMID );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMSendCommInfo
*
* 功能描述: 获取目的PM模块对应的发送信息
*
* 输入参数: emDstPMID：目的（数据接收方）PMID
*
* 输出参数: pstSendInfo：用于返回目的PM对应的发送信息
*
* 返 回 值  : 是否获取成功
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMSendCommInfo( SysPMID_t emDstPMID, SysPMSendInfo_t *pstSendInfo );

/*
***********************************************************************************************************************
* 函数名称: SysSetAutoResume
*
* 功能描述: 设置自动恢复标志位
*
* 输入参数: bAutoResume：自动恢复标志位；
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetAutoResume( bool_t bAutoResume );

/*
***********************************************************************************************************************
* 函数名称: SysGetAutoResume
*
* 功能描述: 获取自动恢复标志位
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 自动恢复标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetAutoResume( void );

/*
***********************************************************************************************************************
* 函数名称: SysSetUserConfirm
*
* 功能描述: 设置用户确认标志位
*
* 输入参数: bUserConfirm：用户确认标志位；
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetUserConfirm( bool_t bUserConfirm );

/*
***********************************************************************************************************************
* 函数名称: SysGetUserConfirm
*
* 功能描述: 获取用户确认标志位
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 用户确认标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetUserConfirm( void );

/*
***********************************************************************************************************************
* 函数名称: SysSetPMIOTolFlag
*
* 功能描述: 设置PM IO 容忍标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*          bTolFlag：容忍标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetPMIOTolFlag( uint8_t ucIOIndex, bool_t bTolFlag );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMIOTolFlag
*
* 功能描述: 获取PM IO 容忍标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*
* 输出参数: 无
*
* 返 回 值  : 容忍标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMIOTolFlag( uint8_t ucIOIndex );

/*
***********************************************************************************************************************
* 函数名称: SysSetPMIOErrFlag
*
* 功能描述: 设置PM IO 错误标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*          bTolFlag：错误标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetPMIOErrFlag( uint8_t ucIOIndex, bool_t bErrFlag );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMIOErrFlag
*
* 功能描述: 获取PM IO 错误标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*
* 输出参数: 无
*
* 返 回 值  : 错误标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMIOErrFlag( uint8_t ucIOIndex );

/*
***********************************************************************************************************************
* 函数名称: SysSetPMIOSendTimeoutFlag
*
* 功能描述: 设置PM IO 发送超时标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*          bSendTimeout：发送超时标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetPMIOSendTimeoutFlag( uint8_t ucIOIndex, bool_t bSendTimeout );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMIOSendTimeoutFlag
*
* 功能描述: 获取PM IO 发送超时标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*
* 输出参数: 无
*
* 返 回 值  : 发送超时标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMIOSendTimeoutFlag( uint8_t ucIOIndex );

/*
***********************************************************************************************************************
* 函数名称: SysSetPMIOFailureFlag
*
* 功能描述: 设置PM IO： IO模块存在故障标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*          bIOFailure：IO模块存在故障标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetPMIOFailureFlag( uint8_t ucIOIndex, bool_t bIOFailure );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMIOFailureFlag
*
* 功能描述: 获取IO模块存在故障标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*
* 输出参数: 无
*
* 返 回 值  : IO模块存在故障标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMIOFailureFlag( uint8_t ucIOIndex );

/*
***********************************************************************************************************************
* 函数名称: SysSetPMIOFVActivedFlag
*
* 功能描述: 设置PM IO： IO模块使用故障安全值标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*          bFVActived：IO模块使用故障安全值标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetPMIOFVActivedFlag( uint8_t ucIOIndex, bool_t bFVActived );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMIOFVActivedFlag
*
* 功能描述: 获取IO模块使用故障安全值标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*
* 输出参数: 无
*
* 返 回 值  : IO模块使用故障安全值标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMIOFVActivedFlag( uint8_t ucIOIndex );

/*
***********************************************************************************************************************
* 函数名称: SysSetPMIONewIParaFlag
*
* 功能描述: 设置PM IO： IO模块采用主站下发的新参数标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*          bNewIPara：模块采用主站下发的新参数标志位。
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void SysSetPMIONewIParaFlag( uint8_t ucIOIndex, bool_t bNewIPara );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMIONewIParaFlag
*
* 功能描述: 获取IO模块采用主站下发的新参数标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*
* 输出参数: 无
*
* 返 回 值  : IO模块采用主站下发的新参数标志位
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMIONewIParaFlag( uint8_t ucIOIndex );

/*
***********************************************************************************************************************
* 函数名称: SysGetPMIOCommInfo
*
* 功能描述: 获取IO模块采用主站下发的新参数标志位
*
* 输入参数: ucIOIndex：IO模块的索引号 - 0-235；
*
* 输出参数: pstCommInfo：用于返回IO模块对应的通信信息
*
* 返 回 值  : 是否获取成功
*
* 注意事项: 无
***********************************************************************************************************************
*/

bool_t SysGetPMIOCommInfo( uint8_t ucIOIndex, SysPMIOCommInfo_t *pstCommInfo );

#endif /* SHARED_RTDATA_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/

