/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 共享内存
*
*  文件名称    : SharedRtData.h
*
*  功能简介    : core0与core1间的共享实时数据
*
*  作者            : 李琦
*
*  创建日期    : 2016-04-15
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef SHARED_RTDATA_H_
#define SHARED_RTDATA_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "inc/DataType.h"
#include "inc/Hardware.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/

/* 数据区长度 */
#define MAX_RTDATA_G_AREA_LEN           (300*1024u)   /* G区大小 */
#define MAX_RTDATA_I_AREA_LEN           (8*1024u)     /* I区大小 */
#define MAX_RTDATA_Q_AREA_LEN           (8*1024u)     /* Q区大小 */

#define RTDATA_AREA_LOCKED              (true)        /* 数据区被锁定，不允许访问*/
#define RTDATA_AREA_UNLOCKED            (false)       /* 数据区未锁定，允许访问 */

#define RTDATA_AREA_READ_ONLY           (true)        /* 实时数据区只读标识 */
#define RTDATA_AREA_WRITE_ONLY          (false)       /* 实时数据区只写标识 */

/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/

/* -------------------实时数据数据结构------------------------------------------------------------------------------------ */
/* 实时数据区 */
#pragma pack(1)
typedef struct SharedRTDataAreaTag
{
    bool_t bLock;                                  /* 是否可以被访问:true-不允许访问 false-允许访问 */
    uint8_t ucReserved1[3];
    bool_t bStatus;                                /* 两种状态：只读或只写: true-只读 false-只写*/
    uint8_t ucReserved2[3];
    uint8_t ucG[MAX_RTDATA_G_AREA_LEN];            /* G区表决后数据内容 */
    uint8_t ucI[MAX_RTDATA_I_AREA_LEN];            /* I区表决后数据内容 */
    uint8_t ucQ[MAX_RTDATA_Q_AREA_LEN];            /* Q区表决后数据内容 */
}SharedRTDataArea_t;
#pragma pack()

/* 数据区类型，供内部通讯使用 */
typedef enum SysRtDataAreaTypeTag
{
    RTDATA_UP1_G_AREA = 0,                         /* UP1 G区 */
    RTDATA_UP2_G_AREA = 1,                         /* UP2 G区 */
    RTDATA_I_AREA = 2,                             /* I区 */
    RTDATA_Q_AREA = 3,                             /* Q区 */
    MAX_RTDATA_AREA_NUM = 4                        /* 数据区个数 */
} SysRtDataAreaType_t;

/* 实时数据区类型，供共享内存实时数据拷贝使用 */
typedef enum SysRtDataTypeTag
{
    RT_DATA_TYPE_G = 0x00,
    RT_DATA_TYPE_I,
    RT_DATA_TYPE_Q,
    NUM_OF_RT_DATA_TYPE,
    INVALID_RT_DATA_TYPE
} SysRtDataType_t;

/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: SharedRtDataInit
*
* 功能描述: 初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedRtDataInit(void);

/*
***********************************************************************************************************************
* 函数名称: SysGetSharedMemRtDataStartAddr
*
* 功能描述: 获取共享内存的实时数据区首地址
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
puint8_t SysGetSharedMemRtDataStartAddr(SysRtDataType_t emDataType);

/*
***********************************************************************************************************************
*                                全局变量
***********************************************************************************************************************
*/
extern SharedRTDataArea_t g_stSharedRtData;


#endif /* SHARED_RTDATA_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/

