/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 共享内存
*
*  文件名称    : SharedConfig.h
*
*  功能简介    : core0与core1间的共享工程配置信息
*
*  作者            : 李琦
*
*  创建日期    : 2016-04-15
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef SHARED_CONFIG_H_
#define SHARED_CONFIG_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "inc/DataType.h"
#include "inc/Hardware.h"
#include "../../Sys/inc/CommSysConfig.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/
#define MAX_CODE_AREA_LEN           (100*1024U)   /* 程序区大小 */


/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/
typedef enum
{
    FIRST_PIECE = 0x00000000,       /*乒乓buffer的第一片区*/
    SECOND_PIECE,                   /*乒乓buffer的第二片区*/
    NUM_OF_BUFF,                    /*乒乓buffer的片区个数*/
    INVALID_BUFF_ID                 /*无效片区号*/
}dbl_buffer_t;

typedef enum
{
    NOT_DOWNLOAD = 0x00000000,      /*当前无下装*/
    INIT_DOWNLOAD,                  /*当前正在进行清空下装*/
    ONLINE_DOWNLOAD,                /*当前正在进行在线下装*/
    DOWN_LOAD_COMPLETE              /*下装完成*/
}download_flag_t;

typedef enum
{
    NOT_CONFIG = 0x00000000,        /*当前没有进行过配置*/
    HAS_CONFIG,                     /*当前有完整的配置信息*/
}config_flag_t;

typedef struct LogicCfgTag
{
    uint32_t uiAvailable;
    LogicConfigInfo_t stLogicConfigInfo[NUM_OF_BUFF];
}LogicCfg_t;

typedef struct SysIoModCfgTag
{
    uint32_t uiAvailable;
    SysIoModInfo_t stSysIoModInfo[NUM_OF_BUFF];
}SysIoModCfg_t;

typedef struct CtrlStationCfgTag
{
    uint32_t uiAvailable;
    CtrlStationConfigInfo_t stCtrlStationConfigInfo[NUM_OF_BUFF];
}CtrlStationCfg_t;

typedef struct SOECfgTag
{
    uint32_t uiAvailable;
    SOEConfigInfo_t stSOEConfigInfo[NUM_OF_BUFF];
}SOECfg_t;

typedef struct P2PCfgTag
{
    uint32_t uiAvailable;
    P2PConfigInfo_t stP2PConfigInfo[NUM_OF_BUFF];
}P2PCfg_t;

typedef struct ModbusMasterCfgTag
{
    uint32_t uiAvailable;
    ModbusMasterInfo_t stModbusMasterInfo[NUM_OF_BUFF];
}ModbusMasterCfg_t;

typedef struct ModbusSlaveCfgTag
{
    uint32_t uiAvailable;
    ModbusSlaveInfo_t stModbusSlaveInfo[NUM_OF_BUFF];
}ModbusSlaveCfg_t;

typedef struct VoteCfgTag
{
    uint32_t uiAvailable;
    VOTEConfigInfo_t stVOTEConfigInfo[NUM_OF_BUFF];
}VoteCfg_t;

typedef struct OPCCfgTag
{
    uint32_t uiAvailable;
    OPCVarInfo_t stOPCVarInfo[NUM_OF_BUFF];
}OPCCfg_t;

typedef struct RetainVarCfgTag
{
    uint32_t uiAvailable;
    RetainVarInfo_t stRetainVarInfo[NUM_OF_BUFF];
}RetainVarCfg_t;

typedef struct CMCfgTag
{
    uint32_t uiAvailable;
    CMConfigInfo_t stCMConfigInfo[NUM_OF_BUFF];
}CMCfg_t;

typedef struct CMSlotIdTablCfgTag
{
    uint32_t uiAvailable;
    CMSlotIdTabl_t stCMSlotIdTabl[NUM_OF_BUFF];
}CMSlotIdTablCfg_t;


/* -------------------配置信息数据结构 ------------------------------------------------------------------------------------ */
typedef struct CodeAreaTag
{
    uint32_t uiAvailable;
    uint8_t ucCodeArea[NUM_OF_BUFF][MAX_CODE_AREA_LEN];
}CodeArea_t;





/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: SharedConfigInit
*
* 功能描述: 初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedConfigInit(void);





/****************************************各类配置信息可读片区对外接口***********************************************************/
/*
***********************************************************************************************************************
* 函数名称: SharedGetLogicInfo
*
* 功能描述: 获取逻辑配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
LogicConfigInfo_t* SharedGetLogicInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetIoModInfo
*
* 功能描述: 获取IO配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
SysIoModInfo_t* SharedGetIoModInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCtrlStationInfo
*
* 功能描述: 获取控制站配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CtrlStationConfigInfo_t* SharedGetCtrlStationInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetLogicInfo
*
* 功能描述: 获取SOE配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
SOEConfigInfo_t* SharedGetSOEConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetP2PConfigInfo
*
* 功能描述: 获取P2P配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
P2PConfigInfo_t* SharedGetP2PConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetModbusMasterInfo
*
* 功能描述: 获取Modbus主配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ModbusMasterInfo_t* SharedGetModbusMasterInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetModbusSlaveInfo
*
* 功能描述: 获取Modbus从配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ModbusSlaveInfo_t* SharedGetModbusSlaveInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetVOTEConfigInfo
*
* 功能描述: 获取通道表决配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
VOTEConfigInfo_t* SharedGetVOTEConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetOPCVarInfo
*
* 功能描述: 获取OPC配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
OPCVarInfo_t* SharedGetOPCVarInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetRetainVarInfo
*
* 功能描述: 获取Retain变量配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
RetainVarInfo_t* SharedGetRetainVarInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCMConfigInfo
*
* 功能描述: 获取CM配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMConfigInfo_t* SharedGetCMConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCMSlotIdTabl
*
* 功能描述: 获取CM槽位号与CM ID对照表信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMSlotIdTabl_t* SharedGetCMSlotIdTabl(void);




/****************************************各类配置信息可写片区对外接口***********************************************************/


/*
***********************************************************************************************************************
* 函数名称: SharedGetLogicInfoWrit
*
* 功能描述: 获取逻辑配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
LogicConfigInfo_t* SharedGetLogicInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetIoModInfoWrit
*
* 功能描述: 获取IO配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
SysIoModInfo_t* SharedGetIoModInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCtrlStationInfoWrit
*
* 功能描述: 获取控制站配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CtrlStationConfigInfo_t* SharedGetCtrlStationInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetLogicInfoWrit
*
* 功能描述: 获取SOE配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
SOEConfigInfo_t* SharedGetSOEConfigInfoWrit (void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetP2PConfigInfoWrit
*
* 功能描述: 获取P2P配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
P2PConfigInfo_t* SharedGetP2PConfigInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetModbusMasterInfoWrit
*
* 功能描述: 获取Modbus主配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ModbusMasterInfo_t* SharedGetModbusMasterInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetModbusSlaveInfoWrit
*
* 功能描述: 获取Modbus从配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ModbusSlaveInfo_t* SharedGetModbusSlaveInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetVOTEConfigInfoWrit
*
* 功能描述: 获取通道表决配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
VOTEConfigInfo_t* SharedGetVOTEConfigInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetOPCVarInfoWrit
*
* 功能描述: 获取OPC配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
OPCVarInfo_t* SharedGetOPCVarInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetRetainVarInfoWrit
*
* 功能描述: 获取Retain变量配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
RetainVarInfo_t* SharedGetRetainVarInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCMConfigInfoWrit
*
* 功能描述: 获取CM配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMConfigInfo_t* SharedGetCMConfigInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCMSlotIdTablWrit
*
* 功能描述: 获取CM槽位号与CM ID对照表信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMSlotIdTabl_t* SharedGetCMSlotIdTablWrit(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSwitchLogicInfo
*
* 功能描述: 切换逻辑配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchLogicInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchIoModInfo
*
* 功能描述: 切换IO配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchIoModInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchCtrlStationInfo
*
* 功能描述: 切换控制站配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchCtrlStationInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchLogicInfo
*
* 功能描述: 切换SOE配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchSOEConfigInfo (void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchP2PConfigInfo
*
* 功能描述: 切换P2P配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchP2PConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchModbusMasterInfo
*
* 功能描述: 切换Modbus主配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchModbusMasterInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchModbusSlaveInfo
*
* 功能描述: 切换Modbus从配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchModbusSlaveInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchVOTEConfigInfo
*
* 功能描述: 切换通道表决配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchVOTEConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchOPCVarInfo
*
* 功能描述: 切换OPC配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchOPCVarInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchRetainVarInfo
*
* 功能描述: 切换Retain变量配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchRetainVarInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchCMConfigInfo
*
* 功能描述: 切换CM配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchCMConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchCMSlotIdTabl
*
* 功能描述: 切换CM槽位号与CM ID对照表信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchCMSlotIdTabl(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetDownloadFlg
*
* 功能描述: 获取系统下装标志。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
download_flag_t SharedGetDownloadFlg(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSetDownloadFlg
*
* 功能描述: 设置系统下装标志。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetDownloadFlg(download_flag_t emDownloadFlg);

/*
***********************************************************************************************************************
* 函数名称: SysGetPrjShedTime
*
* 功能描述: 获取指定任务ID的调度周期。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SysGetPrjShedTime(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SysGetIsConfigured
*
* 功能描述: 获取指定任务ID的调度周期。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint8_t SysGetIsConfigured(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSwitchAllConfigInfo
*
* 功能描述: 控制所有类型配置信息，进行统一的切换
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchAllConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCodeArea
*
* 功能描述: 获取可执行Code区首地址
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
puint8_t SharedGetCodeArea(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCodeAreaWrit
*
* 功能描述: 获取可写Code区首地址
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
puint8_t SharedGetCodeAreaWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchCodeArea
*
* 功能描述: 切换Code区可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchCodeArea(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSwitchPosInit
*
* 功能描述: 初始化钥匙开关位置
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchPosInit(void);

/*
***********************************************************************************************************************
* 函数名称: SharedGetSwitchPos
*
* 功能描述: 从系统资源获取钥匙开关位置
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetSwitchPos(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSetSwitchPos
*
* 功能描述: 设置要是开关
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetSwitchPos(uint32_t uiSwitchPos);

/*
***********************************************************************************************************************
* 函数名称: SharedSetLocalPMID
*
* 功能描述: 设置本地PM的ID
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 本地PM的ID
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetLocalPMID(PMController_t emLocalID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetLocalPMID
*
* 功能描述: 获取本地PM的ID
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 本地PM的ID
*
* 注意事项: 无
***********************************************************************************************************************
*/
PMController_t SharedGetLocalPMID(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetTaskConfigInfo
*
* 功能描述: 获取指定Task的配置信息
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 指定Task的配置信息
*
* 注意事项: 无
***********************************************************************************************************************
*/
TaskConfigInfo_t* SharedGetTaskConfigInfo(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetTaskCodeEntry
*
* 功能描述: 获取指定Task的执行入口
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 指定Task的配置信息
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetTaskCodeEntry(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetTaskGlobalInitEntry
*
* 功能描述: 获取指定Task的GlobalInit的入口
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 指定Task的GlobalInit的入口
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetTaskGlobalInitEntry(Task_ID_t emTaskID);


#endif /* SHARED_CONFIG_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/

