/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 任务层模块
*
*  文件名称    : Task.h
*
*  功能简介    : 创建RTS周期任务、自检任务、通讯任务、文件管理任务
*
*  作者       : 李琦
*
*  创建日期    : 2016-02-01
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef TASK_H_
#define TASK_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/

/* 任务间采用相同优先级，任务间通过时间片轮转运行 */
/* 定义任务优先级 */
#define TASK_PRIO_INIT         (int32_t)(2u)    /* 可选的任务优先级为1~9 */
#define TASK_PRIO_RTS          (int32_t)(3u)
#define TASK_PRIO_DIAG         (int32_t)(3u)
#define TASK_PRIO_COMM         (int32_t)(3u)
#define TASK_PRIO_FILE         (int32_t)(3u)

#define SLID_NUM               (TASK_TIME_SLIDE_RTS + TASK_TIME_SLIDE_DIAG + TASK_TIME_SLIDE_FILE + TASK_TIME_SLIDE_COMM) 
#define TASK_PERIOD            (5U * SLID_NUM)          /* 单位100us */
#define TIME_TOLERANCE         (20)                      /* 时间窗口为100us */

#define RTS_TASK_START_TIME_OFFSET   (0)
#define DIAG_TASK_START_TIME_OFFSET  (TASK_TIME_SLIDE_RTS*5)
#define FILE_TASK_START_TIME_OFFSET  ((TASK_TIME_SLIDE_RTS + TASK_TIME_SLIDE_DIAG)*5)
#define COMM_TASK_START_TIME_OFFSET  ((TASK_TIME_SLIDE_RTS + TASK_TIME_SLIDE_DIAG + TASK_TIME_SLIDE_FILE)*5)


/* 定义任务时间片 */
#if 0
#define TASK_TIME_SLIDE_INIT   (int32_t)(10)    /* 5ms */
#define TASK_TIME_SLIDE_RTS    (int32_t)(7u)    /* 3.5ms */
#define TASK_TIME_SLIDE_DIAG   (int32_t)(1u)    /* 0.5ms */
#define TASK_TIME_SLIDE_COMM   (int32_t)(1u)    /* 0.5ms */
#define TASK_TIME_SLIDE_FILE   (int32_t)(1u)    /* 0.5ms */
#endif
#if 0
#define TASK_TIME_SLIDE_INIT   (int32_t)(500u)    /* 500ms */
#define TASK_TIME_SLIDE_RTS    (int32_t)(350u)    /* 350ms */
#define TASK_TIME_SLIDE_DIAG   (int32_t)(50u)    /* 50ms */
#define TASK_TIME_SLIDE_COMM   (int32_t)(50u)    /* 50ms */
#define TASK_TIME_SLIDE_FILE   (int32_t)(50u)    /* 50ms */
#endif

#define TASK_TIME_SLIDE_INIT   (int32_t)(500*2u)    /* 500ms */
#define TASK_TIME_SLIDE_RTS    (int32_t)(20*2u)     /* 20ms */
#define TASK_TIME_SLIDE_DIAG   (int32_t)(2*2u)      /* 2ms */
#define TASK_TIME_SLIDE_FILE   (int32_t)(3*2u)      /* 3ms */
#define TASK_TIME_SLIDE_COMM   (int32_t)(25*2u)     /* 25ms */

/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/



/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: SysStart
*
* 功能描述: 系统启动函数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysStart(void);

#endif /* TASK_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/

