/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    :
*
*  模块名称    : 数据交换模块
*
*  文件名称    : DataExChange.h
*
*  功能简介    : 完成输入输出数据处理
*
*  作者        :  刘阳
*
*  创建日期    : 2016-09-04
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/
#ifndef DATAEXCHANGE_H_
#define DATAEXCHANGE_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "inc/DataType.h"
#include "Srv/Sys/inc/CommSys.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/
/* 最大IO数据交换长度 */
#define MAX_IO_EXCHANGE_SIZE        (1024*2)          /* IO数据交换数据大小*/

/* 公共返回结果 */
#define RET_OK                      (0U)
#define RET_FAIL                    (1U)

#define MAX_ANALOG_DEVIATION        ((65535*2)/100)

#define TOLERANCE_ALLOWED           (2U)
#define TOLERANCE_NOT_ALLOWED       (0U)
/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/
typedef enum VoteVarType
{
    VVT_DIGITAL_DI = 0, /*表决类型：数字量*/
    VVT_DIGITAL_DO,     /*表决类型：数字量*/
    VVT_ANALOG_AI,      /*表决类型：模拟量*/
    VVT_ANALOG_AO,      /*表决类型：模拟量*/
    VVT_FLOAT,          /*表决类型：模拟量*/
    VVT_INVALID_ID      /*表决类型：无效类型*/
}VoteVarType_t;

typedef enum VoteType
{
    VT_1OO2 = 0,        
    VT_2OO2             
}VoteType_t;

/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: DataExChangeInit
*
* 功能描述: 数据交换模块初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void DataExChangeInit(void);

/*
***********************************************************************************************************************
* 函数名称: DataExChange
*
* 功能描述: 数据交换模块
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void DataExChange(uint8_t ucSrcData[], uint16_t usSrcDataLen, \
                  uint8_t ucPreData[], uint8_t ucNextData[], puint8_t pucPreDataFlg, puint8_t pucNextDataFlg);

/*
***********************************************************************************************************************
* 函数名称: DataExChangeSend
*
* 功能描述: IO数据发送
*
* 输入参数: emPMID:PM的ID号；ucSendDest：需要发送数据的指针；usDataLen：发送数据长度
*
* 输出参数: false：发送失败；true:发送成功
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t DataExChangeSend(PMController_t emPMID , uint8_t ucSendDest[], uint16_t usDataLen);

/*
***********************************************************************************************************************
* 函数名称: DataExChangeRecv
*
* 功能描述: IO数据接收
*
* 输入参数: emPMID:PM的ID号；ucRecvData：用于存储接收到的数据的buff指针；pusDataLen：接收到数据长度的变量指针
*
* 输出参数: false：接收失败；true:接收成功
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t DataExChangeRecv(PMController_t emPMID , uint8_t ucRecvData[], puint16_t pusDataLen);

/*
***********************************************************************************************************************
* 函数名称: DataExChangeVote
*
* 功能描述: IO数据表决
*
* 输入参数: ucModID：模块站号；ucData1：A系数据首地址（若无，指针为空）；ucData2：B系数据首地址（若无，指针为空）；ucData3：C系数据首地址（若无，指针为空）；
*        ucOldData[]:上一次表决结果（用于数据保持）；ucDestBuff：表决数据存放地址；ucDiagBuff：各通道表决结果（bit0:质量位；bit1:是否容忍）
*
* 输出参数: false：表决失败；true:表决成功
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t DataExChangeVote(Task_ID_t emTaskID, uint8_t ucModID , uint8_t ucData1[], uint8_t ucData2[], uint8_t ucData3[], \
                        uint8_t ucOldData[],uint8_t ucDestBuff[], uint8_t ucDiagBuff[]);

/*
***********************************************************************************************************************
* 函数名称: SysGetMedianValue
*
* 功能描述: 用于获取三个值之中的中值（uint16_t）
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint16_t SysGetMedianValue(uint16_t usValue1, uint16_t usValue2, uint16_t usValue3);

/*
***********************************************************************************************************************
* 函数名称: SysGetFloatMedianValue
*
* 功能描述: 用于获取三个浮点值之中的中值
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
float_t SysGetFloatMedianValue(float_t fValue1, float_t fValue2, float_t fValue3);

/*
***********************************************************************************************************************
* 函数名称: SysGetDeviation
*
* 功能描述: 用于获取两个值的差值(uint16_t)
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint16_t SysGetDeviation(uint16_t usValue1, uint16_t usValue2);


#endif
