/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    :
*
*  文件名称    : CPUTest.h
*
*  功能简介    :
*
*  作者            : 李琦
*
*  创建日期    : 2016-11-09
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef CPUTEST_H_
#define CPUTEST_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "inc/DataType.h"
#include "inc/Hardware.h"
#include "../inc/SysTest.h"
#include "../inc/DiagCommon.h"
/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/
#define NUM_SET_DATA_CACHE             (0x00000080U)      /* 数据cache set个数 */
#define NUM_BYTE_BLOCK_DATA_CACHE      (0x00000020U)      /* cache 单个block字节数 */
#define NUM_BLOCK_SET_DATA_CACHE       (0x00000004U)      /* 每个set中block个数 */
#define TEST_DATALINE_NUM              (32U)              /* 测试数据线数 */
#define TEST_ADDRLINE_NUM              (26U)              /* 地址线只检前26根，地址只用到0x00000000 - 0x02FFFFFF */
#define TEST_CACHE_SET_NUM             (8U)               /* 单周期内检测的data cache set 个数 */
#define CPU_TEST_DB_0                  (0x55U)            /* 地址线测试数据背景 */
#define CPU_TEST_DB_1                  (0xAAU)            /* 地址线测试数据背景 */
#define STACK_FILL_BYTE                (0xAAU)            /* 栈检查填充特征字节 */
#define STACK_FILL_SCOPE               (0x10U)            /* 栈填充范围 */

/* CPU类顺序自检项数，除去地址线和数据线 */
#define MAX_CPU_SQ                     (TESTDATACACHE+16U)
/* CPU类顺序自检项数，地址线和数据线 */
#define MAX_LINE_SQ                    (2U)
/* data chche 测试地址类型 */
typedef enum
{
    DATACACHETEST_NORMAL = 1U,
    DATACACHETEST_NEGATE
}DATACACHEID;
/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: CPUTestInit
*
* 功能描述: 初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CPUTestInit(void);
/*
***********************************************************************************************************************
* 函数名称: CPUTestCycle
*
* 功能描述: 自检
*
* 输入参数: 无
*
* 输出参数: puiVectorTest
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CPUTestCycle(puint32_t puiVectorTest);

/*
***********************************************************************************************************************
* 函数名称: ResetTestBit
*
* 功能描述: 清除掩码。
*
* 输入参数: uiMaskTest               掩码
*
* 输出参数: puiVectorTest            错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void ResetTestBit(puint32_t puiVectorTest, uint32_t uiMaskTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestPowerOn
*
* 功能描述: CPU自检上电调度函数。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CpuTestPowerOn(puint32_t puiVectorTest);

/*
***********************************************************************************************************************
* 函数名称: CpuTestLr
*
* 功能描述: 测试链接寄存器。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestLr(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestCr
*
* 功能描述: 测试条件寄存器。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestCr(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestGprInterWord
*
* 功能描述: 测试通用寄存器，针对字间错误类型，采用March测试方法。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestGprInterWord(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestFprInterWord
*
* 功能描述: 测试浮点型寄存器，针对字间错误类型，采用March测试方法。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestFprInterWord(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestGprIntraWord
*
* 功能描述: 测试通用寄存器，针对字内错误类型，采用March测试方法。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestGprIntraWord(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestFprIntraWord
*
* 功能描述: 测试浮点型寄存器，针对字内错误类型，采用March测试方法。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestFprIntraWord(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestSprInterWord
*
* 功能描述: 测试特殊功能寄存器，针对字间错误类型，采用March测试方法。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestSprInterWord(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestSprIntraWord
*
* 功能描述: 测试特殊功能寄存器，针对字内错误类型，采用March测试方法。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestSprIntraWord(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestSprg
*
* 功能描述: 测试SPRG0-SPRG7。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestSprg(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestFpscr
*
* 功能描述: 测试Fpscr
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestFpscr(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestConBranchInst
*
* 功能描述: 测试条件分支跳转指令。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestConBranchInst(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestUnConBranchInst
*
* 功能描述: 测试无条件分支跳转指令。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestUnConBranchInst(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestIu
*
* 功能描述: 测试指令单元。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestIu(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestFpu
*
* 功能描述: 测试浮点型指令单元。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestFpu(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestPipeLine
*
* 功能描述: 测试流水线。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestPipeLine(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestLsu
*
* 功能描述: 测试Load、store单元。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestLsu(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestCriSpr
*
* 功能描述: 测试临界 Spr
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestCriSpr(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestDataCache
*
* 功能描述: 测试数据cache。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestDataCache(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestInstructionCache
*
* 功能描述: 测试指令cache。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : TRUE为测试成功，FALSE为测试失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CpuTestInstructionCache(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestDDRAddressLine
*
* 功能描述: 测试地址线是否正常，采用逐线检测法。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CpuTestDDRAddressLine(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestDDRDataLine
*
* 功能描述: 测试数据线是否正常，采用逐线检测法。
*
* 输入参数: 无
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CpuTestDDRDataLine(puint32_t puiVectorTest);
/*
***********************************************************************************************************************
* 函数名称: CpuTestCheckStack
*
* 功能描述: 检查堆栈是否溢出，通过对堆栈区写入特殊值，检查边界地址是否被改变，如果被改变，则说明堆栈溢出。
*
* 输入参数: stSetExecID       当前需要设置堆栈检查环境的运行空间
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CpuTestCheckStack(excute_id stSetExecID);
/*
***********************************************************************************************************************
* 函数名称: CpuTestSetStack
*
* 功能描述: 设置堆栈边界填充字节。
*
* 输入参数: stSetExecID       当前需要设置堆栈检查环境的运行空间
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CpuTestSetStack(excute_id stSetExecID);
/*
***********************************************************************************************************************
* 函数名称: CheckRunEsitoTest
*
* 功能描述: 检查掩码位设置是否正确。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 返回TRUE表示无错误
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CheckRunEsitoTest(puint32_t puiVectorTest, uint32_t uiMaskTest);

/*
***********************************************************************************************************************
* 函数名称: PrintfReg
*
* 功能描述:
*
* 输入参数:
*
* 输出参数:
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void PrintfReg(uint32_t uiReg1, uint32_t uiReg2,uint32_t uiReg3);

#endif /* CPUTest_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/

