/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    :
*
*  文件名称    : CPUTestAsm.h
*
*  功能简介    : 以下接口函数用汇编语言实现
*
*  作者            : 李琦
*
*  创建日期    : 2016-11-18
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef CPUTESTASM_H_
#define CPUTESTASM_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "inc/DataType.h"
#include "inc/Hardware.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: CheckAddressDataCache
*
* 功能描述: 检查data cache 测试使用的地址是否正确。
*
* 输入参数: uiAddress   地址
*        uiFlag      地址类型标识。
*
* 输出参数:
*
* 返 回 值  : 返回1表示正确，返回0表示错误
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t CheckAddressDataCache(uint32_t uiAddress, uint32_t uiFlag);
/*
***********************************************************************************************************************
* 函数名称: TestLR
*
* 功能描述: 对LR执行march算法测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void TestLR(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: TestCR
*
* 功能描述: 对CR执行march算法测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void TestCR(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: GPRInterWordTest
*
* 功能描述: 对通用寄存器执行march SS算法测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void GPRInterWordTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: GPRIntraWordTest
*
* 功能描述: 对通用寄存器执行march算法测试，测试单个寄存器内部故障。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void GPRIntraWordTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: FPRInterWordTest
*
* 功能描述: 对浮点型寄存器执行march SS算法测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void FPRInterWordTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: FPRIntraWordTest
*
* 功能描述: 对浮点型寄存器执行march SS算法测试，测试单个寄存器内部故障。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void FPRIntraWordTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: SPRInterwordTest
*
* 功能描述: 对特殊功能寄存器执行march算法测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SPRInterwordTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: SPRIntrawordTest
*
* 功能描述: 对特殊功能寄存器执行march算法测试，测试单个寄存器内部故障。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SPRIntrawordTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: SPRGTest
*
* 功能描述: 测试SPRG0-SPRG7错误。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SPRGTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: CriticalSprTestInter
*
* 功能描述: 对关键特殊功能寄存器执行march算法测试，测试字间错误。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CriticalSprTestInter(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: CriticalSprTestIntra
*
* 功能描述: 对关键特殊功能寄存器执行march算法测试，测试单个寄存器内部故障。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CriticalSprTestIntra(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: FpscrTest
*
* 功能描述: FPSCR寄存器测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void FpscrTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: BPUConBranchTest
*
* 功能描述: 条件分支指令测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void BPUConBranchTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: BPUConBranchBcaTest
*
* 功能描述: 条件分支指令测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void BPUConBranchBcaTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: BPUConBranchBclaTest
*
* 功能描述: 条件分支指令测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void BPUConBranchBclaTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: BPUBranchUnconTest
*
* 功能描述: 无条件分支指令测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void BPUBranchUnconTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: BPUBranchUnconBaBlaTest
*
* 功能描述: 无条件分支指令测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void BPUBranchUnconBaBlaTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: IU1Test
*
* 功能描述: 指令单元测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void IU1Test(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: IU2Test
*
* 功能描述: 指令单元测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void IU2Test(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: FPU1Test
*
* 功能描述: 浮点型算术指令测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void FPU1Test(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: FPU2Test
*
* 功能描述: 浮点型特殊指令测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void FPU2Test(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: PipelineTest
*
* 功能描述: 指令流水线测试。
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void PipelineTest(puint32_t puiVectorTest,uint32_t uiMask);
/*
***********************************************************************************************************************
* 函数名称: LSUDataTest
*
* 功能描述: 测试LSU能否正确取数。
*
* 输入参数: uiMask           错误掩码
*        puiTestAddr      测试地址
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void LSUDataTest(puint32_t puiVectorTest,uint32_t uiMask,puint32_t puiTestAddr);
/*
***********************************************************************************************************************
* 函数名称: LSUEffectiveAddressTest
*
* 功能描述: 测试LSU是否能正确计算有效地址。
*
* 输入参数: uiMask           错误掩码
*        puiTestAddr      测试地址
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void LSUEffectiveAddressTest(puint32_t puiVectorTest,uint32_t uiMask,puint32_t puiTestAddr);
/*
***********************************************************************************************************************
* 函数名称: LSUInstructionTest
*
* 功能描述: 测试LSU各指令功能。
*
* 输入参数: uiMask           错误掩码
*        puiTestAddr      测试地址
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void LSUInstructionTest(puint32_t puiVectorTest,uint32_t uiMask,puint32_t puiTestAddr);
/*
***********************************************************************************************************************
* 函数名称: DataCacheTest
*
* 功能描述: 测试数据Cache
*
* 输入参数: uiMask           错误掩码
*        puiTestAddrA     测试地址
*        puiTestAddrB     测试地址
*        uiSetSn          set序号
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void DataCacheTest(puint32_t puiVectorTest,uint32_t uiMask,puint32_t puiTestAddrA,
                    puint32_t puiTestAddrB,uint32_t uiSetSn);
/*
***********************************************************************************************************************
* 函数名称: InstrCacheTest
*
* 功能描述: 测试指令Cache
*
* 输入参数: uiMask           错误掩码
*
* 输出参数: puiVectorTest    错误记录变量
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void InstrCacheTest(puint32_t puiVectorTest,uint32_t uiMask);
#endif /* CPUTESTASM_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/

