/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 系统资源管理模块
*
*  文件名称    : SysCore0RtData.h
*
*  功能简介    : core0上的实时数据
*
*  作者            : 李琦
*
*  创建日期    : 2016-04-20
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef CORE0_RTDATA_H_
#define CORE0_RTDATA_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "inc/DataType.h"
#include "inc/Hardware.h"
#include "Srv/Sys/inc/CommSys.h"
#include "Srv/SharedMem/inc/SharedMem.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/
#define MAX_RTDATA_GS_AREA_LEN           (1024u)   /* Gs区大小 */


/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/
#pragma pack(1)



/* -------------------实时数据数据结构------------------------------------------------------------------------------------ */
/* 运算使用的实时数据区 */
typedef struct PRG_RTDataAreaTag
{
    uint8_t ucG[MAX_RTDATA_G_AREA_LEN];            /* G区数据内容 */
    uint8_t ucI[MAX_RTDATA_I_AREA_LEN];        /* I区表决后数据内容 */
    uint8_t ucQ[MAX_RTDATA_Q_AREA_LEN];            /* Q区本机运算后的数据内容 */
}PRG_RTDataArea_t;

/* PM A B C 三机IO数据，其中两系的IO数据属于另外两机 */
typedef struct PMABC_IOTag
{
    uint8_t ucI[NUM_OF_PM][MAX_RTDATA_I_AREA_LEN]; /* I区数据内容 */
    uint8_t ucQ[NUM_OF_PM][MAX_RTDATA_Q_AREA_LEN]; /* Q区数据内容 */
}PMABC_IO_t;



typedef struct UPVarTag
{
    uint8_t ucVarSize;                              /* 最大8字节 */
    uint8_t ucVar[8];
}UPVar_t;

typedef struct RTDataExchangeTag
{
    UPVar_t ucGVar[MAX_TASK_EXVAR_NUM];            /* G区数据内容 */
    UPVar_t ucIVar[MAX_TASK_EXVAR_NUM];            /* I区数据内容 */
    UPVar_t ucQVar[MAX_TASK_EXVAR_NUM];            /* Q区数据内容 */
}RTDataExchange_t;

#pragma pack()
/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: SysCore0RtDataInit
*
* 功能描述: 初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysCore0RtDataInit(void);

/*
***********************************************************************************************************************
* 函数名称: SysGetPRGRtDataStartAddr
*
* 功能描述: 获取运算的实时数据区首地址
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
puint8_t SysGetPRGRtDataStartAddr(SysRtDataType_t emDataType);

/*
***********************************************************************************************************************
* 函数名称: SysGetRtDataDisableFlagStartAddr
*
* 功能描述: 获取标志区首地址
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
puint8_t SysGetRtDataDisableFlagStartAddr(SysRtDataType_t emDataType);

/*
***********************************************************************************************************************
* 函数名称: SysGetPMIODataStartAddr
*
* 功能描述: 获取相应的PM IO数据区首地址
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
puint8_t SysGetPMIODataStartAddr(PMController_t emPMID, SysRtDataType_t emDataType);



/*
***********************************************************************************************************************
* 函数名称: SysCopyCore0RtDataToSharedRtDataUP1
*
* 功能描述: 拷贝数据（Core0RtData -> SharedRtData）
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : true: 允许访问共享内存，拷贝成功
*        false: 不允许访问共享内存，拷贝失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysCopyCore0RtDataToSharedRtDataUP1(void);

/*
***********************************************************************************************************************
* 函数名称: SysCopyCore0RtDataToSharedRtDataUP2
*
* 功能描述: 拷贝数据（Core0RtData -> SharedRtData）
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : true: 允许访问共享内存，拷贝成功
*        false: 不允许访问共享内存，拷贝失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysCopyCore0RtDataToSharedRtDataUP2(void);

/*
***********************************************************************************************************************
* 函数名称: SysBackupRtDataUP1
*
* 功能描述: up1运算完毕，备份其相应的用于传输到up2的数据
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysBackupRtDataUP1(void);
/*
***********************************************************************************************************************
* 函数名称: SysBackupRtDataUP2
*
* 功能描述: up2运算完毕，备份其相应的用于传输到up1的数据
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysBackupRtDataUP2(void);
/*
***********************************************************************************************************************
* 函数名称: SysExchangeUP1toUP2
*
* 功能描述: 将up1的数据传到up2
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
//void SysExchangeUP1toUP2(void);
/*
***********************************************************************************************************************
* 函数名称: SysExchangeUP2toUP1
*
* 功能描述: 将up2的数据传到up1
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
//void SysExchangeUP2toUP1(void);
#endif /* CORE0_RTDATA_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/

