/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*                                  
*                                  
*  项目名称    : 安全控制系统
*
*  模块名称    : 外部通讯软件应用模块
*
*  文件名称    : FPGALoad.h
*
*  功能简介    : 上电加载FPGA
*
*  作者        : 王东
*
*  创建日期    : 2017-03-31
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef FPGA_LOAD_H_
#define FPGA_LOAD_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "Sys/inc/Sys.h"
#include "Sys/inc/DataType.h"
#include "../inc/uGpio.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/
#define DEBUG_FPGA

#define DEBUG_OUT_FPGA

#ifdef DEBUG_OUT_FPGA
#define DEBUG_FPGA(format, args...)  printf ("DB_FPGA: ") ; printf(format, ##args)
#else
#define DEBUG_FPGA(format, args...)
#endif

/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/

#define FPGA_FILE_SIZE (5*1024*1024)  /* FILESIZE: FPGA file data size: >= 4MB */
//#define BIN_SIZE       (0x40C540)     /* BINSIZE */

#define ESUCCESS  (0)   /* Success */
#define ESTEP1    (-1)  /* GPIO Step1 */
#define ESTEP2    (-2)  /* GPIO Step2 */
#define EOPEN     (-3)  /* Open GPIO device file failed */
#define EWRITE    (-4)  /* Write to SPI device failed */
#define EFIN      (-5)  /* Error after write ok */
#define EIPARA    (-6)  /* Input parameters invalid */

/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: sysCycloneFlush
*
* 功能描述: 上电加载FPGA
*
* 输入参数: iSPIFD：SPI设备FD；
*          pucFPGAPrg：FPGA程序数据；
*          uiFPGAPrgLen：FPGA程序长度。
*
* 输出参数: 无
*
* 返 回 值: 0: 成功； < 0 代表失败，具体如下：
*                  -1：Step 1 failed；
*                  -2：Step 2 failed；
*                  -3：Open GPIO device file failed；
*                  -4：Write to SPI device failed；
*                  -5：parameter invalid。
*
* 注意事项: 无
***********************************************************************************************************************
*/

int32_t sysCycloneFlush( int32_t iSPIFD, uint8_t const pucFPGAPrg[], uint32_t uiFPGAPrgLen );

#endif /* FPGA_LOAD_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/


