/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    :
*
*  文件名称    : CommSysComm.c
*
*  功能简介    :
*
*  作者            : 刘阳
*
*  创建日期    : 2016-04-28
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "../inc/CommSysCommon.h"
#include "Srv/SharedMem/inc/SharedConfig.h"

/*
***********************************************************************************************************************
*                                局部变量声明
***********************************************************************************************************************
*/



/*
***********************************************************************************************************************
*                                局部函数声明
***********************************************************************************************************************
*/





/*
***********************************************************************************************************************
*                                全局函数实现
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: SysGetLocalPMID
*
* 功能描述: 获取本地PM的ID
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 本地PM的ID
*
* 注意事项: 无
***********************************************************************************************************************
*/
PMController_t SysGetLocalPMID(void)
{
    PMController_t emPMID;
    
    emPMID = SharedGetLocalPMID();

    return emPMID;
}

/*
***********************************************************************************************************************
* 函数名称: SysGetNextPMID
*
* 功能描述: 获取后一系PM ID号
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
PMController_t SysGetNextPMID(PMController_t emLocalPMId)
{
    PMController_t emPMID;

    emPMID = (PMController_t)((emLocalPMId + 1U) % NUM_OF_PM);

    return emPMID;
}
/*
***********************************************************************************************************************
* 函数名称: SysGetPrePMID
*
* 功能描述: 获取前一系PM ID号
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
PMController_t SysGetPrePMID(PMController_t emLocalPMId)
{
    PMController_t emPMID;

    emPMID = (PMController_t)((emLocalPMId + NUM_OF_PM - PMB) % NUM_OF_PM);

    return emPMID;
}

/*
***********************************************************************************************************************
* 函数名称: SysGetCfgFileType
*
* 功能描述: 根据文件处理序号获取文件的ID
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
SysCfgFileType_t SysGetCfgFileType(SysFileProcessSeq_t emFileProcessSeq)
{
    SysCfgFileType_t emCfgFileType = INVALID_CFG_FILE_TYPE;
    
    switch(emFileProcessSeq)
    {
        case PS_PRG:
        {
            emCfgFileType = CFG_PRG;
        }
        break;
        case PS_CM:
        {
            emCfgFileType = CFG_CM;
        }
        break;
        case PS_IO_MODULAR:
        {
            emCfgFileType = CFG_IO_MODULAR;
        }
        break;
        case PS_SOE:
        {
            emCfgFileType = CFG_SOE;
        }
        break;
        case PS_P2P:
        {
            emCfgFileType = CFG_P2P;
            
        }
        break;
        case PS_MODBUS_MASTER:
        {
            emCfgFileType = CFG_MODBUS_MASTER;
        }
        break;
        case PS_MODBUS_SLAVE:
        {
            emCfgFileType = CFG_MODBUS_SLAVE;
        }
        break;
        case PS_VOTE:
        {
            emCfgFileType = CFG_VOTE;
        }
        break;
        case PS_RETAIN:
        {
            emCfgFileType = CFG_RETAIN;
        }
        break;
        case PS_OPC:
        {
            emCfgFileType = CFG_OPC;
        }
        break;
        case PS_CTRL_STATION:
        {
            emCfgFileType = CFG_CTRL_STATION;
        }
        break;
        default:
        break;
    }
    
    return emCfgFileType;
}
/*
***********************************************************************************************************************
* 函数名称: SysGetBin1Num
*
* 功能描述: 获取接收应答结果
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SysGetBin1Num(uint32_t uiValue)
{
    uint32_t uiRet = 0U;
    
    while(uiValue)
    {
        uiRet++;
        uiValue &= (uiValue - 1);
    }
    
    return uiRet;
}

/*
***********************************************************************************************************************
*                                局部函数实现
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/
