/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
* 
*  模块名称    : 共享内存
*
*  文件名称    : SharedWatchdog.h
*
*  功能简介    : core0与core1间看门狗相关的共享变量
*
*  作者            : 李琦
*
*  创建日期    : 2016-08-08
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include <Srv/Scheduler/include/string.h>
#include <Srv/Scheduler/cagos.h>
#include "../inc/SharedWatchdog.h"
#include "../inc/SharedComm.h"

/*
***********************************************************************************************************************
*                                局部变量声明
***********************************************************************************************************************
*/
static SMWatchdog_t  s_stSMWTD;

/*
***********************************************************************************************************************
*                                局部函数声明
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
*                                全局函数实现
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: SharedWatchdogInit
*
* 功能描述: 初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedWatchdogInit(void)
{
    /* 初始化 */
    memset((puint8_t)&s_stSMWTD, 0, sizeof(SMWatchdog_t));

    return;
}

/*
***********************************************************************************************************************
* 函数名称: SysGetSMWatchdogInfo
*
* 功能描述: 从共享内存中获取看门狗相关的信息
*
* 输入参数: 无
*
* 输出参数: puiCounter: 计数值
*
* 返 回 值  : true-收到消息
*        false- 1)不允许访问  2)输入输出参数错误
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysGetSMWatchdogInfo(puint32_t puiCounter)
{
    SMWatchdog_t *pstMsgBox = NULL;
    bool_t bRet = false;
    bool_t bResult = false;

    /* 输入输出参数有效性检查 */
    if(puiCounter != NULL)
    {
        /* 找到待读出信息的信箱 */
        pstMsgBox = &s_stSMWTD;

        /* 原子操作：读锁标志，判断是否已加锁，若未加锁，则加锁，返回成功标志；若已加锁，则返回失败标志 */
        bResult = (bool_t) atomic32Cas((puint32_t)&(pstMsgBox->uiLock), \
                                       (uint32_t)SM_MSGBOX_UNLOCKED, \
                                       (uint32_t)SM_MSGBOX_LOCKED);

        if(true == bResult)
        {
            /* 获取内容 */
            *puiCounter = s_stSMWTD.uiCounter;
            /* 读取成功 */
            bRet = true;
            /* 原子操作：解除锁标志 */
            atomic32Set((puint32_t)&(pstMsgBox->uiLock), (uint32_t)SM_MSGBOX_UNLOCKED);
        }
        else
        {
            bRet = false;
        }
    }
    return bRet;
}

/*
***********************************************************************************************************************
* 函数名称: SysSetSMWatchdogInfo
*
* 功能描述: 向共享内存中设置看门狗相关的信息
*
* 输入参数: uiCounter：计数值
*
* 输出参数: 无
*
* 返 回 值  : 写入成功或失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysSetSMWatchdogInfo(uint32_t uiCounter)
{
    SMWatchdog_t *pstMsgBox = NULL;
    bool_t bRet = false;
    bool_t bResult = false;

    /* 找到待写入信息的信箱 */
    pstMsgBox = &s_stSMWTD;

    /* 原子操作：读锁标志，判断是否已加锁，若未加锁，则加锁，返回成功标志；若已加锁，则返回失败标志 */
    bResult = (bool_t) atomic32Cas((puint32_t)&(pstMsgBox->uiLock), \
                                   (uint32_t)SM_MSGBOX_UNLOCKED, \
                                   (uint32_t)SM_MSGBOX_LOCKED);

    if(true == bResult)
    {
         /* 写入内容 */
        s_stSMWTD.uiCounter = uiCounter;
        /* 写入成功 */
        bRet = true;
        /* 原子操作：解除锁标志 */
        atomic32Set((puint32_t)&(pstMsgBox->uiLock), (uint32_t)SM_MSGBOX_UNLOCKED);
    }
    else
    {
        /* 不允许访问或信箱为满，则写入失败 */
        bRet = false;
    }

    return bRet;
}

/*
***********************************************************************************************************************
*                                局部函数实现
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/
