/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 系统资源管理模块
*
*  文件名称    : SysP2P.h
*
*  功能简介    :
*
*  作者       : 李琦
*
*  创建日期    : 2015-12-31
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef SYS_P2P_H_
#define SYS_P2P_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "DataType.h"
#include "Hardware.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/
#define MAX_P2P_MSG_LEN         (1024*3u)    /*最大请求或应答消息内容长度  */
#define MAX_P2P_MSG_NUM         (126u)       /*队列中最多存放P2P消息的数量*/

/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/
/* 消息*/
typedef struct SysP2PMsgTag
{
    uint16_t usLen;                             /* 消息内容长度 */
    uint8_t ucContent[MAX_P2P_MSG_LEN];         /* 存放消息内容 */
} SysP2PMsg_t;

/* 信箱 */
typedef struct SysP2PMsgBoxTag
{
    bool_t bLock;                               /* 信箱是否可以被访问 */
    bool_t bMsgBoxStatus;                       /* 信箱的两种状态：空或满 */
    SysP2PMsg_t stMsg;                          /* 消息 */
} SysP2PMsgBox_t;

/* 消息队列*/
typedef struct SysP2PMsgQueueTag
{
    uint16_t usHead;                            /* 队列头部*/
    uint16_t usTail;                            /* 队列尾部 */
    uint16_t usNum;                             /* 队列中元素个数 */
    SysP2PMsg_t stMsg[MAX_P2P_MSG_NUM];         /* 消息 */
} SysP2PMsgQueue_t;

/* 消息类型（请求或应答）*/
typedef enum SysP2PMsgTypeTag
{
    P2P_PM_REQ = 0,                             /* PM发请求 */
    P2P_PM_RESP = 1,                            /* PM收应答 */
    P2P_EXT_REQ = 2,                            /* 收来自外部请求 */
    P2P_EXT_RESP = 3,                           /* 发应答给外部 */
    NUM_OF_P2PMSGTYPE
} SysP2PMsgType_t;

/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: SysP2PInit
*
* 功能描述: 静态变量初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysP2PInit(void);

/*
***********************************************************************************************************************
* 函数名称: SysGetP2PMsg
*
* 功能描述: 从系统资源模块获取消息（请求/应答）
*
* 输入参数: emPMID: PM的ID
*        emMsgType: 各种消息类型
*
* 输出参数: pucContent: 指向待读出的消息内容
*         pusLen: 指向待读出的消息内容长度
*
* 返 回 值  : true-收到消息
*        false- 1)无数据  2)不允许访问  3)输入输出参数错误
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysGetP2PMsg(PMController_t emPMID, SysP2PMsgType_t emMsgType, puint8_t pucContent, puint16_t pusLen);

/*
***********************************************************************************************************************
* 函数名称: SysGetP2PMsgLen
*
* 功能描述: 从系统资源模块获取消息（请求/应答）的长度
*
* 输入参数: emPMID: PM的ID
*        emMsgType: 各种消息类型
*
* 输出参数: pusLen: 指向待读出的消息内容长度
*
* 返 回 值  : true-读取成功
*        false- 1)无数据  2)不允许访问  3)输入输出参数错误
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysGetP2PMsgLen(PMController_t emPMID, SysP2PMsgType_t emMsgType, puint16_t pusLen);

/*
***********************************************************************************************************************
* 函数名称: SysSetP2PMsg
*
* 功能描述: 将请求或应答消息写入系统资源模块
*
* 输入参数: emPMID: PM的ID
*        emMsgType: 各种消息类型
*
* 输出参数: pucContent: 指向待写入的消息内容
*         pusLen: 指向待写入的消息内容长度
*
* 返 回 值  : 写入成功或失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysSetP2PMsg(PMController_t emPMID, SysP2PMsgType_t emMsgType , puint8_t pucContent, uint16_t usLen);

/*
***********************************************************************************************************************
* 函数名称: SysSetStationMsg
*
* 功能描述: 将其它控制站的请求/应答消息写入队列
*
* 输入参数: emMsgType: 各种消息类型
*
* 输出参数: pucContent: 指向待写入的消息内容
*         pusLen: 指向待写入的消息内容长度
*
* 返 回 值  : 写入成功或失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysSetStationMsg(SysP2PMsgType_t emMsgType, puint8_t pucContent, uint16_t usLen);

/*
***********************************************************************************************************************
* 函数名称: SysGetStationMsg
*
* 功能描述: 从队列中读出来自其它控制站的请求/应答消息
*
* 输入参数: emMsgType: 各种消息类型
*
* 输出参数: pucContent: 指向待写入的消息内容
*         pusLen: 指向待写入的消息内容长度
*
* 返 回 值  : 读取成功或失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysGetStationMsg(SysP2PMsgType_t emMsgType, puint8_t pucContent, puint16_t pusLen);

/*
***********************************************************************************************************************
* 函数名称: SysGetStationMsgNum
*
* 功能描述: 从系统资源模块获取消息（请求/应答）的个数
*
* 输入参数: emMsgType: 各种消息类型
*
* 输出参数: pusNum: 指向待读出的消息个数
*
* 返 回 值  : true-读取成功
*        false- 1)无数据   2)输入输出参数错误
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysGetStationMsgNum(SysP2PMsgType_t emMsgType, puint16_t pusNum);

#endif /* SYS_P2P_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/

