/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 系统资源管理模块
*
*  文件名称    : SysRTData.h
*
*  功能简介    :
*
*  作者       : 李琦
*
*  创建日期    : 2016-03-11
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef SYS_RTDATA_H_
#define SYS_RTDATA_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "inc/DataType.h"
#include "Srv/SharedMem/inc/SharedMem.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/
#define RTDATA_AREA_READ_FINISHED           (true)        /* 相应数据区读完 */
#define RTDATA_AREA_READ_NOT_FINISHED       (false)       /* 相应数据区未读完 */

#define MAX_RTDATA_APPEND_INFO_SIZE        (1024*50U)        /* 预留1024*30字节存放版本信息等 */

/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/

/* 实时数据区 */
typedef struct RTDataAreaTag
{
    bool_t bLock;                                   /* 是否可以被访问:true-不允许访问 false-允许访问 */
    bool_t bDataAreaStatus;                         /* 两种状态：只读或只写: true-只读 false-只写*/
    bool_t bReadFlag[MAX_RTDATA_AREA_NUM][NUM_OF_CM];          /* true:读完  false 未读完 */
    uint32_t uiReadOffset[MAX_RTDATA_AREA_NUM][NUM_OF_CM];     /* 当前读操作的偏移地址 */
    uint32_t uiLen[MAX_RTDATA_AREA_NUM];            /* G/I/Q区数据长度 */
    uint8_t ucContent[MAX_RTDATA_G_AREA_LEN];       /* G区数据内容 */
    uint8_t ucInputContent[MAX_RTDATA_I_AREA_LEN];  /* I区数据内容 */
    uint8_t ucOutputContent[MAX_RTDATA_Q_AREA_LEN]; /* Q区数据内容及版本*/
    uint8_t ucAppendInfo[MAX_RTDATA_APPEND_INFO_SIZE]; /* 存放SharedAppend_t结构体信息 */
} RTDataArea_t;

/* 两个实时数据区交替使用 */
typedef enum RTDataAreaIndexTag
{
    RTDATA_AREA_A = 0,                              /* 实时数据区A*/
    NUM_OF_RTDATA_AREA,                             /* 实时数据区个数 */
    INVALID_RTDATA_AREA_INDEX                       /* 实时数据区错误的索引号 */
} RTDataAreaIndex_t;

/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: SysRTDataInit
*
* 功能描述: 静态变量初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysRTDataInit(void);

/*
***********************************************************************************************************************
* 函数名称: SysReadRTData
*
* 功能描述: 读取实时数据
*
* 输入参数: emDataArea: 实时数据区类型
*         usLen: 预读取的实时数据长度
*
* 输出参数: pucContent: 指向实时数据内容
*
* 返 回 值  : true-读取成功
*        false-输出参数有误或者读取失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysReadRTData(SysRtDataAreaType_t emDataArea, puint8_t pucContent, uint16_t usLen, puint16_t pusRdLen,CMController_t emCMID);

/*
***********************************************************************************************************************
* 函数名称: SysReadRTDataReset
*
* 功能描述: 复位读操作
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : true-操作成功
*        false-操作失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysReadRTDataReset(void);

/*
***********************************************************************************************************************
* 函数名称: SysGetRTDataReadOffset
*
* 功能描述: 获取实时数据区的读偏移地址
*
* 输入参数: 无
*
* 输出参数: puiOffset：指向读偏移地址
*
* 返 回 值  : true-读取成功
*        false- 失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysGetRTDataReadOffset(SysRtDataAreaType_t emDataArea, puint32_t puiOffset,CMController_t emCMID);

/*
***********************************************************************************************************************
* 函数名称: SysGetRTDataAreaLen
*
* 功能描述: 获取实时数据区的数据长度
*
* 输入参数: emDataArea: 数据区类型
*
* 输出参数: puiLen：指向数据区长度
*
* 返 回 值  : true-读取成功
*        false- 失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysGetRTDataAreaLen(SysRtDataAreaType_t emDataArea, puint32_t puiLen,CMController_t emCMID);

/*
***********************************************************************************************************************
* 函数名称: SysGetRTDataReadFlag
*
* 功能描述: 相应数据区是否读取完毕
*
* 输入参数: emDataArea: 数据区类型
*
* 输出参数: pbReadFlag：指向读取是否完毕标志
*
* 返 回 值  : true-读取成功
*        false- 失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysGetRTDataReadFlag(SysRtDataAreaType_t emDataArea, bool_t *pbReadFlag,CMController_t emCMID);

/*
***********************************************************************************************************************
* 函数名称: SysCopySharedRtDataToCore1RtData
*
* 功能描述: 拷贝数据（SharedRtdata -> Core1RtData）
*
* 输入参数: emDataArea
*               uiOffset
*               uiSize
*
* 输出参数: 无
*
* 返 回 值  : true: 允许访问共享内存，拷贝成功
*        false: 不允许访问共享内存，拷贝失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysCopySharedRtDataToCore1RtData(SysRtDataAreaType_t emDataArea, uint32_t uiOffset, uint32_t uiSize, uint32_t uiAreaUsedLen);

/*
***********************************************************************************************************************
* 函数名称: SysSetCopyRtDataFinished
*
* 功能描述: SharedRtdata -> Core1RtData
*
* 输入参数: 
*
* 输出参数: 无
*
* 返 回 值  : 
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysSetCopyRtDataFinished(void);
/*
***********************************************************************************************************************
* 函数名称: SysSetRtDataAreaWriteOnly
*
* 功能描述: 将整个实时数据区置为只写标志
*
* 输入参数:
*
* 输出参数: 无
*
* 返 回 值  :
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysSetRtDataAreaWriteOnly(void);

#endif /* SYS_RTDATA_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/
