/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 工程配置模块
*
*  文件名称    : PMconfig.h
*
*  功能简介    : 完成对工程文件的配置
*
*  作者           : 刘阳
*
*  创建日期    : 2015-12-30
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/
#ifndef PMCONFIG_H_
#define PMCONFIG_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "Srv/SysResource/inc/SysCommon.h"
#include "Srv/SysResource/inc/SysPMConfig.h"
#include "Srv/SysResource/inc/SysCfgFile.h"
#include "Srv/SysResource/inc/SysStateMngt.h"
#include "Srv/Algrithm/inc/Algrithm.h"
#include "Srv/Scheduler/include/string.h"
#include "Srv/SharedMem/inc/SharedConfig.h"
#include "Srv/SharedMem/inc/SharedSOE.h"
#include "Srv/IPBUS/inc/IPBUS.h"
#include "Srv/Scheduler/cagos.h"
#include "APP/Comm/inc/Comm.h"
#include "Srv/ExtLib/inc/ExtLib.h"
#include "Srv/SharedSys/inc/SysCore0RtData.h"
#include "Srv/SharedSys/inc/SysMonitor.h"
/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/
#define DEBUG_OUT_CONFIG
#ifdef DEBUG_OUT_CONFIG
#define DEBUG_CONFIG(format, args...)  printf ("D_CONFIG: ") ; printf(format, ##args)
#else
#define DEBUG_CONFIG(format, args...)
#endif



/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/
#define MAX_FILE_LEN                (1024*1024)

typedef void (*GlobaInit)(uint32_t);

/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/

/*
********************************函数描述*******************************************************************************
* 函数名称: ConfigInit
*
* 功能描述: 模块初始化函数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void ConfigInit(void);

/*
********************************函数描述*******************************************************************************
* 函数名称: ConfigCycle
*
* 功能描述: 模块周期执行函数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/

void ConfigCycle(void);





#endif /*PMCONFIG_H_*/

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/
