/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 共享内存
*
*  文件名称    : SharedConfig.h
*
*  功能简介    : core0与core1间的共享工程配置信息
*
*  作者            : 李琦
*
*  创建日期    : 2016-04-15
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef SHARED_CONFIG_H_
#define SHARED_CONFIG_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "inc/DataType.h"
#include "inc/Hardware.h"
#include "Srv/Sys/inc/CommSysConfig.h"
#include "Srv/Sys/inc/CommSysStateMngt.h"
#include "Srv/Sys/inc/CommSysMonitor.h"
#include "Srv/Sys/inc/SysHardware.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/
#define MAX_CODE_AREA_LEN               (500*1024U)   /* 程序区大小 */

#define TASK_NOT_SINGLE_STEP            (0x00000000)
#define TASK_SINGLE_STEP                (0x00000001)

#define NOT_NEED_POWERON_CONIFG_SWITCH  (0x00000000)
#define NEED_POWERON_CONIFG_SWITCH      (0x00000001)

#define NOT_NEED_DISABLE_RECOVER        (0x00000000)
#define NEED_DISABLE_RECOVER            (0x00000001)

/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/
typedef enum
{
    FIRST_PIECE = 0x00000000,       /*乒乓buffer的第一片区*/
    SECOND_PIECE,                   /*乒乓buffer的第二片区*/
    NUM_OF_BUFF,                    /*乒乓buffer的片区个数*/
    INVALID_BUFF_ID                 /*无效片区号*/
}dbl_buffer_t;

typedef enum
{
    NOT_DOWNLOAD = 0x00000000,      /*当前无下装*/
    INIT_DOWNLOAD,                  /*当前正在进行清空下装*/
    ONLINE_DOWNLOAD,                /*当前正在进行在线下装*/
    DOWN_LOAD_FILE_DONE,            /*下装文件完成*/
    DOWN_LOAD_COMPLETE              /*下装完成，配置完成*/
}download_flag_t;

typedef enum
{
    NOT_CONFIG = 0x00000000,        /*当前没有进行过配置*/
    HAS_CONFIG,                     /*当前有完整的配置信息*/
}config_flag_t;

typedef enum
{
    DATA_NOT_SYNC = 0x00000000,        /*当前没有进行过数据同步*/
    DATA_SYNC_TRANS_OK,                /*当前数据同步传输工作完成*/
    DATA_SYNC_COMPLETE,                /*当前已经进行过数据同步*/
}sync_data_flag_t;

typedef enum
{
    OS_NOT_NEED_SWITCH = 0x00000000,       /*不需要在线下装切换*/
    OS_SWITCH_START,                       /*开始在线下装切换*/
    OS_SLAVE_ENABLE,                       /*需要使能从站配置*/
    OS_CONFIG_SWITCH,                      /*需要切换工程配置信息*/
    OS_CODE_SWITCH,                        /*需要切换工程Code区*/
    
}OnlineDownLoad_Switch_Flg_t;



typedef struct LogicCfgTag
{
    uint32_t uiAvailable;
    LogicConfigInfo_t stLogicConfigInfo[NUM_OF_BUFF];
}LogicCfg_t;

typedef struct ExLibCfgTag
{
    uint32_t uiAvailable;
    ExLibConfigInfo_t stExLibConfigInfo[NUM_OF_BUFF];
}ExLibCfg_t;


typedef struct SysIoModCfgTag
{
    uint32_t uiAvailable;
    uint32_t uiTmpAvailable[MAX_TASK_NUM];
    SysIoModInfo_t stSysIoModInfo[NUM_OF_BUFF];
}SysIoModCfg_t;

typedef struct CtrlStationCfgTag
{
    uint32_t uiAvailable;
    uint32_t uiTmpAvailable[MAX_TASK_NUM];
    CtrlStationConfigInfo_t stCtrlStationConfigInfo[NUM_OF_BUFF];
}CtrlStationCfg_t;

typedef struct SOECfgTag
{
    uint32_t uiAvailable;
    uint32_t uiTmpAvailable[MAX_TASK_NUM];
    SOEConfigInfo_t stSOEConfigInfo[NUM_OF_BUFF];
}SOECfg_t;

typedef struct P2PCfgTag
{
    uint32_t uiAvailable;
    P2PConfigInfo_t stP2PConfigInfo[NUM_OF_BUFF];
}P2PCfg_t;

typedef struct ModbusMasterCfgTag
{
    uint32_t uiAvailable;
    ModbusMasterInfo_t stModbusMasterInfo[NUM_OF_BUFF];
}ModbusMasterCfg_t;

typedef struct ModbusSlaveCfgTag
{
    uint32_t uiAvailable;
    ModbusSlaveInfo_t stModbusSlaveInfo[NUM_OF_BUFF];
}ModbusSlaveCfg_t;

typedef struct VoteCfgTag
{
    uint32_t uiAvailable;
    VOTEConfigInfo_t stVOTEConfigInfo[NUM_OF_BUFF];
}VoteCfg_t;

typedef struct OPCCfgTag
{
    uint32_t uiAvailable;
    OPCVarInfo_t stOPCVarInfo[NUM_OF_BUFF];
}OPCCfg_t;

typedef struct RetainVarCfgTag
{
    uint32_t uiAvailable;
    RetainVarInfo_t stRetainVarInfo[NUM_OF_BUFF];
}RetainVarCfg_t;

typedef struct CMCfgTag
{
    uint32_t uiAvailable;
    CMConfigInfo_t stCMConfigInfo[NUM_OF_BUFF];
}CMCfg_t;

typedef struct CMSlotIdTablCfgTag
{
    uint32_t uiAvailable;
    CMSlotIdTabl_t stCMSlotIdTabl[NUM_OF_BUFF];
}CMSlotIdTablCfg_t;


/* -------------------配置信息数据结构 ------------------------------------------------------------------------------------ */
typedef struct CodeAreaTag
{
    uint32_t uiAvailable;
    uint32_t uiTmpAvailable[MAX_TASK_NUM];
    uint8_t ucCodeArea[NUM_OF_BUFF][MAX_CODE_AREA_LEN];
}CodeArea_t;





/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: SharedConfigInit
*
* 功能描述: 初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedConfigInit(void);

/*
***********************************************************************************************************************
* 函数名称: SharedConfigAreaInit
*
* 功能描述: 配置信息结构片区初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedConfigAreaInit(void);



/****************************************各类配置信息可读片区对外接口***********************************************************/
/*
***********************************************************************************************************************
* 函数名称: SharedGetLogicInfo
*
* 功能描述: 获取逻辑配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
LogicConfigInfo_t* SharedGetLogicInfo(void);

/*
***********************************************************************************************************************
* 函数名称: SharedGetExLibInfo
*
* 功能描述: 获取外部库配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ExLibConfigInfo_t* SharedGetExLibInfo(void);

/*
***********************************************************************************************************************
* 函数名称: SharedGetIoModInfo
*
* 功能描述: 获取IO配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
SysIoModInfo_t* SharedGetIoModInfo(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCtrlStationInfo
*
* 功能描述: 获取控制站配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CtrlStationConfigInfo_t* SharedGetCtrlStationInfo(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetLogicInfo
*
* 功能描述: 获取SOE配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
SOEConfigInfo_t* SharedGetSOEConfigInfo(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetP2PConfigInfo
*
* 功能描述: 获取P2P配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
P2PConfigInfo_t* SharedGetP2PConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetModbusMasterInfo
*
* 功能描述: 获取Modbus主配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ModbusMasterInfo_t* SharedGetModbusMasterInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetModbusSlaveInfo
*
* 功能描述: 获取Modbus从配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ModbusSlaveInfo_t* SharedGetModbusSlaveInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetVOTEConfigInfo
*
* 功能描述: 获取通道表决配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
VOTEConfigInfo_t* SharedGetVOTEConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetOPCVarInfo
*
* 功能描述: 获取OPC配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
//OPCVarInfo_t* SharedGetOPCVarInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetRetainVarInfo
*
* 功能描述: 获取Retain变量配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
RetainVarInfo_t* SharedGetRetainVarInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCMConfigInfo
*
* 功能描述: 获取CM配置信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMConfigInfo_t* SharedGetCMConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCMSlotIdTabl
*
* 功能描述: 获取CM槽位号与CM ID对照表信息指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMSlotIdTabl_t* SharedGetCMSlotIdTabl(void);




/****************************************各类配置信息可写片区对外接口***********************************************************/


/*
***********************************************************************************************************************
* 函数名称: SharedGetLogicInfoWrit
*
* 功能描述: 获取逻辑配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
LogicConfigInfo_t* SharedGetLogicInfoWrit(void);

/*
***********************************************************************************************************************
* 函数名称: SharedGetExLibInfoWrit
*
* 功能描述: 获取外部库配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ExLibConfigInfo_t* SharedGetExLibInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetIoModInfoWrit
*
* 功能描述: 获取IO配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
SysIoModInfo_t* SharedGetIoModInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCtrlStationInfoWrit
*
* 功能描述: 获取控制站配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CtrlStationConfigInfo_t* SharedGetCtrlStationInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetLogicInfoWrit
*
* 功能描述: 获取SOE配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
SOEConfigInfo_t* SharedGetSOEConfigInfoWrit (void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetP2PConfigInfoWrit
*
* 功能描述: 获取P2P配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
P2PConfigInfo_t* SharedGetP2PConfigInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetModbusMasterInfoWrit
*
* 功能描述: 获取Modbus主配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ModbusMasterInfo_t* SharedGetModbusMasterInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetModbusSlaveInfoWrit
*
* 功能描述: 获取Modbus从配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
ModbusSlaveInfo_t* SharedGetModbusSlaveInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetVOTEConfigInfoWrit
*
* 功能描述: 获取通道表决配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
VOTEConfigInfo_t* SharedGetVOTEConfigInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetOPCVarInfoWrit
*
* 功能描述: 获取OPC配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
//OPCVarInfo_t* SharedGetOPCVarInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetRetainVarInfoWrit
*
* 功能描述: 获取Retain变量配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
RetainVarInfo_t* SharedGetRetainVarInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCMConfigInfoWrit
*
* 功能描述: 获取CM配置信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMConfigInfo_t* SharedGetCMConfigInfoWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCMSlotIdTablWrit
*
* 功能描述: 获取CM槽位号与CM ID对照表信息可写片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
CMSlotIdTabl_t* SharedGetCMSlotIdTablWrit(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSwitchLogicInfo
*
* 功能描述: 切换逻辑配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchLogicInfo(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSwitchExLibInfo
*
* 功能描述: 切换外部库配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchExLibInfo(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSwitchIoModInfo
*
* 功能描述: 切换IO配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchIoModInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchCtrlStationInfo
*
* 功能描述: 切换控制站配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchCtrlStationInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchLogicInfo
*
* 功能描述: 切换SOE配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchSOEConfigInfo (void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchP2PConfigInfo
*
* 功能描述: 切换P2P配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchP2PConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchModbusMasterInfo
*
* 功能描述: 切换Modbus主配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchModbusMasterInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchModbusSlaveInfo
*
* 功能描述: 切换Modbus从配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchModbusSlaveInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchVOTEConfigInfo
*
* 功能描述: 切换通道表决配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchVOTEConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchOPCVarInfo
*
* 功能描述: 切换OPC配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
//void SharedSwitchOPCVarInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchRetainVarInfo
*
* 功能描述: 切换Retain变量配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchRetainVarInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchCMConfigInfo
*
* 功能描述: 切换CM配置信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchCMConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchCMSlotIdTabl
*
* 功能描述: 切换CM槽位号与CM ID对照表信息可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchCMSlotIdTabl(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetDownloadFlg
*
* 功能描述: 获取系统下装标志。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
download_flag_t SharedGetDownloadFlg(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSetDownloadFlg
*
* 功能描述: 设置系统下装标志。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetDownloadFlg(download_flag_t emDownloadFlg);

/*
***********************************************************************************************************************
* 函数名称: SysGetPrjShedTime
*
* 功能描述: 获取指定任务ID的调度周期。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SysGetPrjShedTime(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SysGetIsConfigured
*
* 功能描述: 获取指定任务ID的调度周期。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SysGetIsConfigured(void);
/*
***********************************************************************************************************************
* 函数名称: SysSetIsConfigured
*
* 功能描述: 设置本机PM是否有可用的配置信息。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysSetIsConfigured(uint32_t ucIsConfigured);

/*
***********************************************************************************************************************
* 函数名称: SharedSwitchAllConfigInfo
*
* 功能描述: 控制所有类型配置信息，进行统一的切换
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchAllConfigInfo(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCodeArea
*
* 功能描述: 获取可执行Code区首地址
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
puint8_t SharedGetCodeArea(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetCodeAreaWrit
*
* 功能描述: 获取可写Code区首地址
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
puint8_t SharedGetCodeAreaWrit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedSwitchCodeArea
*
* 功能描述: 切换Code区可读片区指针
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchCodeArea(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSwitchPosInit
*
* 功能描述: 初始化钥匙开关位置
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchPosInit(void);

/*
***********************************************************************************************************************
* 函数名称: SharedGetSwitchPos
*
* 功能描述: 从系统资源获取钥匙开关位置
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetSwitchPos(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSetSwitchPos
*
* 功能描述: 设置要是开关
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetSwitchPos(uint32_t uiSwitchPos);

/*
***********************************************************************************************************************
* 函数名称: SharedSetLocalPMID
*
* 功能描述: 设置本地PM的ID
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 本地PM的ID
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetLocalPMID(PMController_t emLocalID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetLocalPMID
*
* 功能描述: 获取本地PM的ID
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 本地PM的ID
*
* 注意事项: 无
***********************************************************************************************************************
*/
PMController_t SharedGetLocalPMID(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetTaskConfigInfo
*
* 功能描述: 获取指定Task的配置信息
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 指定Task的配置信息
*
* 注意事项: 无
***********************************************************************************************************************
*/
TaskConfigInfo_t* SharedGetTaskConfigInfo(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetTaskCodeEntry
*
* 功能描述: 获取指定Task的执行入口
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 指定Task的配置信息
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetTaskCodeEntry(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetTaskGlobalInitEntry
*
* 功能描述: 获取指定Task的GlobalInit的入口
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 指定Task的GlobalInit的入口
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetTaskGlobalInitEntry(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetTaskChangeGlobalInitEntry
*
* 功能描述: 获取指定Task的ChangeGlobalInit的入口
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 指定Task的ChangeGlobalInit的入口
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetTaskChangeGlobalInitEntry(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SysGetTaskStatus
*
* 功能描述: 获取指定PM内指定任务的任务状态
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
task_status_t SysGetTaskStatus(PMController_t emPMId, Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SysSetTaskStatus
*
* 功能描述: 设置指定PM内指定任务的任务状态
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysSetTaskStatus(PMController_t emPMId, Task_ID_t emTaskID, task_status_t emTaskStatus);

/*
***********************************************************************************************************************
* 函数名称: SysGetTaskSingleStepFlg
*
* 功能描述: 获取指定任务的单步状态
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SysGetTaskSingleStepFlg(Task_ID_t emTaskID);

/*
***********************************************************************************************************************
* 函数名称: SysSetTaskSingleStepFlg
*
* 功能描述: 设置指定任务的单步状态
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysSetTaskSingleStepFlg(Task_ID_t emTaskID, uint32_t uiSingleStepFlg);

/*
***********************************************************************************************************************
* 函数名称: SharedGetTaskNum
*
* 功能描述: 获取任务个数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 任务个数
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint8_t SharedGetTaskNum(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetSyncDataFlag
*
* 功能描述: 获取UP任务是否被同步过数据的标志
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 任务个数
*
* 注意事项: 无
***********************************************************************************************************************
*/
sync_data_flag_t SharedGetSyncDataFlag(Task_ID_t emTaskID);

/*
***********************************************************************************************************************
* 函数名称: SharedSetSyncDataFlag
*
* 功能描述: 设置UP任务是否被同步过数据的标志
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 任务个数
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetSyncDataFlag(Task_ID_t emTaskID, sync_data_flag_t emSyncDataFlag);

/*
***********************************************************************************************************************
* 函数名称: SharedGetModType
*
* 功能描述: 获取指定地址的模块的类型
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 模块的类型
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint16_t SharedGetModType(Task_ID_t emTaskID,uint8_t ucModID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetVoteInfo
*
* 功能描述: 获取指定地址的模块的表决信息
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 模块的类型
*
* 注意事项: 无
***********************************************************************************************************************
*/
VoteModInfo_t* SharedGetVoteInfo(uint8_t ucModID);

/*
***********************************************************************************************************************
* 函数名称: SharedGetTolerate
*
* 功能描述: 获取容忍次数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 模块的类型
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint8_t SharedGetTolerate(void);

/*
***********************************************************************************************************************
* 函数名称: SharedGetSOEType
*
* 功能描述: 获取获取SOE块的软硬属性
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 模块的类型
*
* 注意事项: 无
***********************************************************************************************************************
*/
SOEType_t SharedGetSOEType(uint8_t ucSOEBlockID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetSOEActive
*
* 功能描述: 获取获取SOE块是否有配置信息的标志
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 模块的类型
*
* 注意事项: 无
***********************************************************************************************************************
*/
ActiveFlag_t SharedGetSOEActive(uint8_t ucSOEBlockID);

/*
***********************************************************************************************************************
* 函数名称: SharedGetP2PSendBlockNum
*
* 功能描述: 获取P2P发送块的个数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetP2PSendBlockNum(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetP2PBlockSendCycle
*
* 功能描述: 获取P2P块当发送周期
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 模块的类型
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetP2PBlockSendCycle(uint8_t ucP2PBlockIndex);
/*
***********************************************************************************************************************
* 函数名称: SharedGetP2PBlockSendActive
*
* 功能描述: 获取P2P发送块的是否Active
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 模块的类型
*
* 注意事项: 无
***********************************************************************************************************************
*/
ActiveFlag_t SharedGetP2PBlockSendActive(uint8_t ucP2PBlockIndex);
/*
***********************************************************************************************************************
* 函数名称: SharedGetP2PBlockRecvActive
*
* 功能描述: 获取P2P接收块的是否Active
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 模块的类型
*
* 注意事项: 无
***********************************************************************************************************************
*/
ActiveFlag_t SharedGetP2PBlockRecvActive(uint8_t ucP2PBlockIndex);
/*
***********************************************************************************************************************
* 函数名称: SharedGetP2PSendBlockInfo
*
* 功能描述: 获取P2P发送块的配置信息
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 模块的类型
*
* 注意事项: 无
***********************************************************************************************************************
*/
P2PBlock_t* SharedGetP2PSendBlockInfo(uint8_t ucP2PBlockIndex);
/*
***********************************************************************************************************************
* 函数名称: SharedGetP2PRecvBlockInfo
*
* 功能描述: 获取P2P接收块的配置信息
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 模块的类型
*
* 注意事项: 无
***********************************************************************************************************************
*/
P2PBlock_t* SharedGetP2PRecvBlockInfo(uint8_t ucP2PBlockIndex);
/*
***********************************************************************************************************************
* 函数名称: SharedGetStationID
*
* 功能描述: 获取控制站ID号
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 模块的类型
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetStationID(void);

/*
***********************************************************************************************************************
* 函数名称: SharedGetTolCnt
*
* 功能描述: 获取容忍次数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 容忍次数
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetTolCnt(void);

/*
***********************************************************************************************************************
* 函数名称: SharedGetConfigCrc
*
* 功能描述: 获取指定文件配置信息结构内记录的文件CRC
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 文件CRC
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetConfigCrc(SysCfgFileType_t emCfgFileType);
/*
***********************************************************************************************************************
* 函数名称: SharedGetDownloadPM
*
* 功能描述: 获取接收1131下装的PM ID号
*
* 输入参数:  
*
* 输出参数: PM ID号
*
* 返 回 值  : 
*
* 注意事项: 无
***********************************************************************************************************************
*/
PMController_t SharedGetDownloadPM(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSetDownloadPM
*
* 功能描述: 设置接收1131下装的PM ID号
*
* 输入参数:  PM ID号
*
* 输出参数: 
*
* 返 回 值  : 
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetDownloadPM(PMController_t emDownloadPMID);
/*
***********************************************************************************************************************
* 函数名称: SharedGetPowerOnConfigSwitchFlg
*
* 功能描述: 获取上电配置切换标志
*
* 输入参数:  
*
* 输出参数: 上电配置切换标志
*
* 返 回 值  : 
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetPowerOnConfigSwitchFlg(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSetPowerOnConfigSwitchFlg
*
* 功能描述: 设置上电配置切换标志
*
* 输入参数:  上电配置切换标志
*
* 输出参数: 
*
* 返 回 值  : 
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetPowerOnConfigSwitchFlg(uint32_t uiPowerOnConfigSwitch);
/*
***********************************************************************************************************************
* 函数名称: SysGetWorkStatus
*
* 功能描述: 获取指定PM的工作状态
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
work_status_t SysGetWorkStatus(PMController_t emLocalPMId);
/*
***********************************************************************************************************************
* 函数名称: SysSetWorkStatus
*
* 功能描述: 设置指定PM的工作状态
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysSetWorkStatus(PMController_t emPMId, work_status_t emWork_Status);
/*
***********************************************************************************************************************
* 函数名称: SharedGetWRParaBufID
*
* 功能描述: 获取双口上可写的参数片区
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint8_t SharedGetWRParaBufID();

/*
***********************************************************************************************************************
* 函数名称: SharedSwitchUsedParaBufID
*
* 功能描述: 对双口上使用的片区进行切换
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSwitchUsedParaBufID();
/*
***********************************************************************************************************************
* 函数名称: SharedGetOnlineDownLoadSwitchFlg
*
* 功能描述: 获取在线下装切换标志
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
OnlineDownLoad_Switch_Flg_t SharedGetOnlineDownLoadSwitchFlg(Task_ID_t TaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedSetOnlineDownLoadSwitchFlg
*
* 功能描述: 设置在线下装切换标志
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetOnlineDownLoadSwitchFlg(Task_ID_t TaskID, OnlineDownLoad_Switch_Flg_t emOnlineDownLoadSwitchFlg);
/*
***********************************************************************************************************************
* 函数名称: SharedRecordTmpAvailable
*
* 功能描述: 用于在线下装时记录旧配置片区
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedRecordTmpAvailable(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedClearIOTmpAvailable
*
* 功能描述: 清除IO配置的临时记录标志
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedClearIOTmpAvailable(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedClearCSTmpAvailable
*
* 功能描述: 清除控制站配置的临时记录标志
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedClearCSTmpAvailable(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedClearCodeTmpAvailable
*
* 功能描述: 清除Code区的临时记录标志
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedClearCodeTmpAvailable(Task_ID_t emTaskID);

/*
***********************************************************************************************************************
* 函数名称: SharedClearSOETmpAvailable
*
* 功能描述: 清除SOE配置的临时记录标志
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedClearSOETmpAvailable(Task_ID_t emTaskID);

/*
***********************************************************************************************************************
* 函数名称: SharedOnlineDownLoadFillDualDataTable
*
* 功能描述: 在线下装时，根据配置填充从站输入输出区基地址及长度数据表
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedOnlineDownLoadFillDualDataTable(Task_ID_t emTaskID);
/*
***********************************************************************************************************************
* 函数名称: SharedModConfigChangeInit
*
* 功能描述: 模块的参数变化标志初始化
*
* 输入参数: 无
*
* 输出参数: bool_t
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedModConfigChangeInit(void);
/*
***********************************************************************************************************************
* 函数名称: SharedGetModConfigChangeFlg
*
* 功能描述: 获取指定模块的参数变化标志
*
* 输入参数: 无
*
* 输出参数: bool_t
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SharedGetModConfigChangeFlg(uint8_t ucModAddr);
/*
***********************************************************************************************************************
* 函数名称: SharedSetModConfigChangeFlg
*
* 功能描述: 设置指定模块的参数变化标志
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetModConfigChangeFlg(uint8_t ucModAddr, bool_t bModConfigChangeFlg);
/*
***********************************************************************************************************************
* 函数名称: SharedGetDisableRecoverFlg
*
* 功能描述: 获取Disable表恢复标志
*
* 输入参数:  
*
* 输出参数: Disable表恢复标志
*
* 返 回 值  : 
*
* 注意事项: 无
***********************************************************************************************************************
*/
uint32_t SharedGetDisableRecoverFlg(void);

/*
***********************************************************************************************************************
* 函数名称: SharedSetDisableRecoverFlg
*
* 功能描述: 设置Disable表恢复标志
*
* 输入参数:  Disable表恢复标志
*
* 输出参数: 
*
* 返 回 值  : 
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedSetDisableRecoverFlg(uint32_t uiDisableRecover);

#endif /* SHARED_CONFIG_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/

