/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    :
*
*  文件名称    : Monitor.c
*
*  功能简介    : 完成Core1内状态的监控，处理同步模块同步的部分任务（需要Core1处理的）
*
*  作者            : 刘阳
*
*  创建日期    : 2016-04-14
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "../inc/Monitor.h"
#include "Srv/SysResource/inc/Sys.h"
#include "Srv/Sys/inc/CommSys.h"

/*
***********************************************************************************************************************
*                                局部变量声明
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
*                                局部函数声明
***********************************************************************************************************************
*/
void MonitorGetSysState(void);

/*
***********************************************************************************************************************
*                                全局函数实现
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: MonitorInit
*
* 功能描述: 初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void MonitorInit(void)
{
    /*初始化温度*/
    SysTemperatureInit();

    /*初始化电源电压报警位*/
    SysSupplyAlarmBitInit();

    /*初始化PM离在线状态*/
    SysPMHardStatusInit(PMA);
    SysPMHardStatusInit(PMB);
    SysPMHardStatusInit(PMC);
    
}

/*
***********************************************************************************************************************
* 函数名称: MonitorCycle
*
* 功能描述: 周期运行函数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void MonitorCycle(void)
{
//    printf("  MonitorCycle  \n");
    PMController_t emLocalPMId = SysGetLocalPMID();
    uint16_t usPMState = 0U;
    
    MonitorGetSysState();
    
    usPMState = SharedGetPMState();
    SysSetPMState(emLocalPMId, usPMState);

    return;
}




/*
***********************************************************************************************************************
*                                局部函数实现
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: MonitorGetSysState
*
* 功能描述: 周期获取硬件寄存器内记录的系统状态
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void MonitorGetSysState(void)
{
    PMController_t emLocalPMId = SysGetLocalPMID();                 /* 本PMID号           */
    PMController_t emNextPMId = SysGetNextPMID(emLocalPMId);        /* 下一个PMID号     */
    PMController_t emPrePMId = SysGetPrePMID(emLocalPMId);          /* 前一个PMID号     */

    /*从硬件寄存器获取温度，并写在系统资源*/
    SysReadTemperature();
    /*从硬件寄存器获取电源电压，并写在系统资源*/
    SysReadSupplyAlarmBit();
    /*从硬件寄存器获取本机PM id，并写在系统资源*/
//    SysReadLocalPMID();
    
    /*从硬件寄存器获取PM离在线状态，并写在系统资源*/
    SysReadPMHardStatus(emLocalPMId);
    SysReadPMHardStatus(emNextPMId);
    SysReadPMHardStatus(emPrePMId);

    SysReadPPMStat();
    SysReadMCUStat();

    return;
}






/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/
