/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
* 
*  模块名称    : 任务层模块
*
*  文件名称    : TimingTask.c
*
*  功能简介    : 校时任务
*
*  作者       : 李琦
*
*  创建日期    : 2015-12-30
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include <stdio.h>
#include <stdlib.h>
#include <sys/types.h>
#include <unistd.h>
#include <sys/wait.h>
#include <sys/time.h>
#include <string.h>
#include <sched.h>
#include <unistd.h>
#include <sys/resource.h>
#include "../inc/TimingTask.h"

/*
 ***********************************************************************************************************************
 *                                全局变量声明
 ***********************************************************************************************************************
 */
extern pid_t MainID;
extern pid_t TimingID;

/*
***********************************************************************************************************************
*                                局部变量声明
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
*                                局部函数声明
***********************************************************************************************************************
*/

static void TskTimingTaskInit(void);

static void TskTimingTaskCycle(void);

/*
***********************************************************************************************************************
*                                全局函数实现
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: TskTimingTask
*
* 功能描述: 校时任务
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void TskTimingTask(void)
{
    //struct timeval stTmpTimeVal;
    uint32_t uiStartTime = 0;
    uint32_t uiFinishTime = 0;
    uint32_t uiIntervalTime = 0;

    int prio_process;
    //int prio;//-5
    prio_process = getpriority(PRIO_PROCESS, TimingID);
    printf("Timing Process (%d) Priority is %d.\n", TimingID, prio_process);

#if 0
    unsigned long mask = 0;
    
    mask = 1; /* process switches to processor 0 now */
    if (sched_setaffinity(0, sizeof(mask), &mask) <0)
    {
        perror("sched_setaffinity");
    }
#endif
    /* 校时任务初始化函数  */
    TskTimingTaskInit();

    /* 校时任务周期运行函数  */
    while(1)
    {
        //memset(&stTmpTimeVal, 0, sizeof(struct timeval));
        //gettimeofday(&stTmpTimeVal, NULL);
        //uiStartTime = stTmpTimeVal.tv_sec * 1000 *1000 + stTmpTimeVal.tv_usec;
        uiStartTime = SysGetFreeCounterValue32(); //us
        
        printf("Timing task\n");
        TskTimingTaskCycle();

        //gettimeofday(&stTmpTimeVal, NULL);
        //uiFinishTime = stTmpTimeVal.tv_sec * 1000 *1000 + stTmpTimeVal.tv_usec;
        uiFinishTime = SysGetFreeCounterValue32(); //us

        uiIntervalTime = TIMING_TASK_PERIOD - (uiFinishTime - uiStartTime);
        usleep(uiIntervalTime);
    }
}

/*
***********************************************************************************************************************
*                                局部函数实现
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
* 函数名称: TskTimingTaskInit
*
* 功能描述: 校时任务初始函数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项:
***********************************************************************************************************************
*/

static void TskTimingTaskInit(void)
{
    /* NTP模块初始化 */

    /* GPS模块初始化 */
}

/*
***********************************************************************************************************************
* 函数名称: TskTimingTaskCycle
*
* 功能描述: 校时任务周期运行函数
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值: 无
*
* 注意事项:
***********************************************************************************************************************
*/

static void TskTimingTaskCycle(void)
{
    /* NTP模块周期运行函数*/

    /* GPS模块周期运行函数 */

}
/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/
