/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 系统资源管理模块
*
*  文件名称    : SysSync.c
*
*  功能简介    : 系统资源管理模块中的同步功能模块，供其他同步功能相关模块调用
*
*  作者            : 刘阳
*
*  创建日期    : 2016-03-23
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include <Srv/Scheduler/include/string.h>
#include <Srv/Scheduler/include/stdio.h>
#include <Srv/Scheduler/cagos.h>
#include "../inc/CommSysSync.h"
#include "../inc/CommSys.h"

/*
***********************************************************************************************************************
*                                局部变量声明
***********************************************************************************************************************
*/
sys_ajust_t emSyncAjust;



/*
***********************************************************************************************************************
*                                局部函数声明
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
*                                全局函数实现
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: CommSysSyncInit
*
* 功能描述: 初始化。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void CommSysSyncInit(void)
{
    emSyncAjust = AJUST_NO;
}
/*
***********************************************************************************************************************
* 函数名称: SysGetSyncTime
*
* 功能描述: 获取同步时钟值(百微秒)。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysGetSyncTime(SyncTime64_t* punSyncTime)
{
    uint16_t usHigh16 = 0;
    uint32_t uiLow32 = 0;

    if(punSyncTime != NULL)
    {
        usHigh16 = SysGetSyncTimeHigh16();
        punSyncTime->stTimeStruct.uiHigh32b = (uint32_t)usHigh16;

        uiLow32 = SysGetSyncTimeLow32();
        punSyncTime->stTimeStruct.uiLow32b = (uint32_t)uiLow32;
    }
    return;
}

/*
***********************************************************************************************************************
* 函数名称: SysSetSyncTime
*
* 功能描述: 设置同步时钟值(百微秒)。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysSetSyncTime(SyncTime64_t* punSyncTime)
{
    uint16_t usTime1;
    uint16_t usTime2;
    uint16_t usTime3;
    uint32_t uiTime;
    
    usTime1 = punSyncTime->stTimeStruct.uiLow32b & (UINT16_MASK);
    usTime2 = (punSyncTime->stTimeStruct.uiLow32b >> UINT16_BITS) &  
                                             (UINT16_MASK);
    usTime3 = punSyncTime->stTimeStruct.uiHigh32b & (UINT16_MASK);
    
    
    fpga_write(REG_SYNC_ADJUST_TIME1,usTime1);
    fpga_write(REG_SYNC_ADJUST_TIME2,usTime2);
    fpga_write(REG_SYNC_ADJUST_TIME3,usTime3);
    
    uiTime = usTime2;
    uiTime = (uiTime << UINT16_BITS) + usTime1;
    
    printf("ADJUST: uiTime is : %d %d \n",uiTime,usTime3);
    
//    printf("ADJUST: uiLow32b is : %d \n",punSyncTime->stTimeStruct.uiLow32b);

    /* set enable adjust time */
    fpga_write(REG_SYNC_ADJUST_TIME_ENABLE,SYS_SYNC_ENAJTTIME);
    
    return;
}
/*
***********************************************************************************************************************
* 函数名称: SysGetSyncAjust
*
* 功能描述: 获取同步时钟是否校时状态。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
sys_ajust_t SysGetSyncAjust(void)
{
    sys_ajust_t emRetAjustFlag = emSyncAjust;

    return emRetAjustFlag;
}
/*
***********************************************************************************************************************
* 函数名称: SysSetSyncAjust
*
* 功能描述: 设置同步时钟是否校时状态。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysSetSyncAjust(sys_ajust_t emRetAjustFlag)
{
    emSyncAjust = emRetAjustFlag;
    
    return;
}

/*
***********************************************************************************************************************
*                                局部函数实现
***********************************************************************************************************************
*/


/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/
