/*
*********************************************************************************************************************** 
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 共享内存
*
*  文件名称    : SharedHandshake.h
*
*  功能简介    : core0与core1间握手信号，用于同步
*
*  作者            : 李琦
*
*  创建日期    : 2016-09-08
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef SHARED_HANDSHAKE_H_
#define SHARED_HANDSHAKE_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "inc/DataType.h"
#include "inc/Hardware.h"
#include "Srv/Sys/inc/CommSysCommon.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/
/* 信号传输方向 */
#define CORE0_TO_CORE1                    (0U)
#define CORE1_TO_CORE0                    (1U)

/* 信号类型 */
/* 没有信号 */
#define SIGNAL_NONE                        (0U)
/* core0启动信号，由core1发送 */
#define SIGNAL_CORE0_STEP1                 (1U)
/* core1启动信号，由core0发送 */
#define SIGNAL_CORE1_STEP1                 (1U)
/* core0启动信号，由core1发送 */
#define SIGNAL_CORE0_STEP2                 (2U)
/* core1启动信号，由core0发送 */
#define SIGNAL_CORE1_STEP2                 (2U)
/* core0启动信号，由core1发送 */
#define SIGNAL_CORE0_STEP3                 (3U)
/* core1启动信号，由core0发送 */
#define SIGNAL_CORE1_STEP3                 (3U)
/* core0启动信号，由core1发送 */
#define SIGNAL_CORE0_START                 (4U)
/* core1启动信号，由core0发送 */
#define SIGNAL_CORE1_START                 (4U)
/* core1需要同步实时数据，由core1发送给core0 */
#define SIGNAL_CORE1_SYN_RTDATA            (5U)
/* core1不需要同步实时数据，由core1发送给core0 */
#define SIGNAL_CORE1_NOT_SYN_RTDATA        (6U)
/* core0初始化启动信号，由core1发送 */
#define SIGNAL_CORE0_STEP0                 (7U)
/* core1初始化启动信号，由core0发送 */
#define SIGNAL_CORE1_STEP0                 (7U)

/* 通过core0校准系统时间，发送给core1，最终发送到CM */
#define SIGNAL_PM_SYS_TIME                 (0x10U)

/* 通过CM校准系统时间，core1发送给core0，最终发送到CM */
#define SIGNAL_CM_SYS_TIME                 (0x11U)

#define SIGNAL_CORE0_DIAG_DONE0             (0xA0U)
#define SIGNAL_CORE0_DIAG_DONE1             (0xA1U)
#define SIGNAL_CORE0_DIAG_DONE2             (0xA2U)
#define SIGNAL_CORE0_DIAG_NOT_DONE          (0xA3U)

#define SIGNAL_CORE1_DIAG_DONE0             (0xB0U)
#define SIGNAL_CORE1_DIAG_DONE1             (0xB1U)
#define SIGNAL_CORE1_DIAG_DONE2             (0xB2U)
#define SIGNAL_CORE1_DIAG_NOT_DONE          (0xB3U)


/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/

/* 信箱 */
typedef struct HandshakeSignalTag
{
    uint32_t uiLock;                                /* 是否可以被访问 */
    uint32_t uiSignal;                              /* 存放信号*/
} HandshakeSignal_t;

/* 校时信箱 */
typedef struct AdjSysTimeSignalTag
{
    uint32_t uiLock;                                /* 是否可以被访问 */
    uint32_t uiSignal;                              /* 存放信号*/
    uint32_t uiSec;                                 /* 存放秒*/
    uint32_t uiMilSec;                              /* 存放毫秒*/
} AdjSysTimeSignal_t;
/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: SharedHandshakeInit
*
* 功能描述: 初始化
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SharedHandshakeInit(void);


/*
***********************************************************************************************************************
* 函数名称: SysGetHandshakeSignal
*
* 功能描述: 从共享内存中获取握手信号
*
* 输入参数: uiSignalTrans: 信号传输方向
*        puiSignal: 存放信号
*
* 输出参数: 无
*
* 返 回 值  : 获取成功或失败
*
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysGetHandshakeSignal(uint32_t uiSignalTrans, puint32_t puiSignal);


/*
***********************************************************************************************************************
* 函数名称: SysSetHandshakeSignal
*
* 功能描述: 向共享内存中设置握手信号
*
* 输入参数: uiSignalTrans: 信号传输方向
*        uiSignal: 信号
*
* 输出参数: 无
*
* 返 回 值  : 写入成功或失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysSetHandshakeSignal(uint32_t uiSignalTrans, uint32_t uiSignal);

/*
***********************************************************************************************************************
* 函数名称: SysGetSysTimeSignal
*
* 功能描述: 从共享内存中获取系统时间信号
*
* 输入参数: uiSignalTrans: 信号传输方向
*        pstSysTime: 存放信号类型及时间
*
* 输出参数: 无
*
* 返 回 值  : 获取成功或失败
*
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysGetSysTimeSignal(uint32_t uiSignalTrans, AdjSysTimeSignal_t *pstSysTime);

/*
***********************************************************************************************************************
* 函数名称: SysSetSysTimeSignal
*
* 功能描述: 向共享内存中设置系统时间信号
*
* 输入参数: uiSignalTrans: 信号传输方向
*        pstSysTime: 系统时间信号
*
* 输出参数: 无
*
* 返 回 值  : 写入成功或失败
*
* 注意事项: 无
***********************************************************************************************************************
*/
bool_t SysSetSysTimeSignal(uint32_t uiSignalTrans, AdjSysTimeSignal_t *pstSysTime);

#endif /* SHARED_HANDSHAKE_H_ */

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/

