/*
***********************************************************************************************************************
*                  Copyright(c) 北京康吉森技术有限公司 2015
*           Beijing Consen Technologies Co.,Ltd. All rights reserved.
*
*
*  项目名称    : 安全控制系统
*
*  模块名称    : 系统状态管理模块
*
*  文件名称    : SysStateManager.h
*
*  功能简介    : 完成对系统状态的管理
*
*  作者           : 刘阳
*
*  创建日期    : 2016-04-01
*
*  版本信息    : V1.0
*
*  修订信息    : 无
*
***********************************************************************************************************************
*/

#ifndef STATE_H_
#define STATE_H_

/*
***********************************************************************************************************************
*                                包含头文件
***********************************************************************************************************************
*/
#include "inc/DataType.h"
#include "Srv/SysResource/inc/Sys.h"
#include "APP/Comm/inc/Comm.h"
#include"Srv/IPBUS/inc/IPBUS.h"

/*
***********************************************************************************************************************
*                                宏定义
***********************************************************************************************************************
*/

#define DEBUG_OUT_STATMNGT
#ifdef DEBUG_OUT_STATMNGT
#define DEBUG_STATMNGT(format, args...)  printf ("D_STAT: ") ; printf(format, ##args)
#else
#define DEBUG_STATMNGT(format, args...)
#endif


/* 系统状态改变 */
#define SYS_STATE_CHANGED                                   (0x00000001U)
/* 系统状态未改变 */
#define SYS_STATE_NOCHANGED                                 (0x00000000U)

/* 有新控制器加入 */
#define SYS_SYNC_STATE_NOTREADY                             (0x00000000U)
/* 无新控制器加入 */
#define SYS_SYNC_STATE_READY                                (0x00000001U)

///* 非稳定状态个数 */
//#define MAX_UNSTABLE_STATE                                  (0x0000001DU)
///* 稳态个数 */
//#define MAX_STABLE_STATE                                    (0x0000000cU)

/* 非稳定状态个数 */
#define MAX_UNSTABLE_STATE                                  (0x0000000aU)
/* 稳态个数 */
#define MAX_STABLE_STATE                                    (0x00000008U)


///***********************************非稳态*************************************/
///*系统工作状态  （ P：Poweron_Sync  O：Offline  R：Run  T：Stop  S：Standby  D:OnlineDownload）*/
//#define P_O_O                                               (0x00010000)
//#define P_O_S                                               (0x00010002)
//#define P_O_T                                               (0x00010003)
//#define P_O_R                                               (0x00010004)
//#define P_S_O                                               (0x00010200)
//#define P_S_S                                               (0x00010202)
//#define P_T_O                                               (0x00010300)
//#define P_T_T                                               (0x00010303)
//#define P_R_O                                               (0x00010400)
//#define P_R_R                                               (0x00010404)
//#define S_O_P                                               (0x00020001)
//#define S_P_O                                               (0x00020100)
//#define S_P_S                                               (0x00020102)
//#define S_S_P                                               (0x00020201)
//#define T_O_P                                               (0x00030001)
//#define T_P_O                                               (0x00030100)
//#define T_P_T                                               (0x00030103)
//#define T_T_P                                               (0x00030301)
//#define R_O_P                                               (0x00040001)
//#define R_P_O                                               (0x00040100)
//#define R_P_R                                               (0x00040104)
//#define R_R_P                                               (0x00040401)
//
///*test*/
//#define R_P_P                                               (0x00040101)
//#define P_R_P                                               (0x00010401)
//#define P_P_R                                               (0x00010104)
///*test*/
///*在系统其它PM处于OnlineDownload状态，不允许新的PM上电；等待在线下装过程完成后，系统处于稳态，允许其他PM上电
// *OnlineDownload服务需要同步，系统内所有正常运行PM都应同时转变为OnlineDownload状态，否则为错误*/
//#define D_O_O                                               (0x00050000)
//#define D_D_O                                               (0x00050500)
//#define D_O_D                                               (0x00050005)
//#define D_D_D                                               (0x00050505)
//
//
///***********************************稳态*************************************/
//
//#define S_O_O                                               (0x00020000)
//#define S_O_S                                               (0x00020002)
//#define S_S_O                                               (0x00020200)
//#define S_S_S                                               (0x00020202)
//#define T_O_O                                               (0x00030000)
//#define T_O_T                                               (0x00030003)
//#define T_T_O                                               (0x00030300)
//#define T_T_T                                               (0x00030303)
//#define R_O_O                                               (0x00040000)
//#define R_O_R                                               (0x00040004)
//#define R_R_O                                               (0x00040400)
//#define R_R_R                                               (0x00040404)



/*系统工作状态:  W：Work(PM内有可用工程，处于工作状态)  S：Standby(PM内没有可用工程，处于备用状态)  O：Offline(PM离线)*/

/***********************************非稳态*************************************/
#define S_O_W                                               (0x00010002)
#define S_W_O                                               (0x00010200)
#define S_W_W                                               (0x00010202)
#define W_O_S                                               (0x00020001)
#define W_S_O                                               (0x00020100)
#define W_S_W                                               (0x00020102)
#define W_W_S                                               (0x00020201)


#define S_S_W                                               (0x00010102)
#define S_W_S                                               (0x00010201)
#define W_S_S                                               (0x00020101)

/***********************************稳态*************************************/
#define S_O_O                                               (0x00010000)
#define S_O_S                                               (0x00010001)
#define S_S_O                                               (0x00010100)
#define S_S_S                                               (0x00010101)
#define W_O_O                                               (0x00020000)
#define W_O_W                                               (0x00020002)
#define W_W_O                                               (0x00020200)
#define W_W_W                                               (0x00020202)

/***********************************异常状态*************************************/


/*
***********************************************************************************************************************
*                                数据结构定义
***********************************************************************************************************************
*/
/* PM状态等级排序 */
typedef enum
{
    CMP_LOCAL = 0x00000000U,
    CMP_PRE,
    CMP_NEXT
}triple_cmp_t;



/*
***********************************************************************************************************************
*                                全局函数声明
***********************************************************************************************************************
*/
/*
***********************************************************************************************************************
* 函数名称: StateMngtInit
*
* 功能描述: 系统状态管理初始化。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void StateMngtInit(void);
/*
***********************************************************************************************************************
* 函数名称: SysStateMngt
*
* 功能描述: 系统状态管理函数，周期性检测系统状态，当系统处于非稳态时进行相应处理。
*
* 输入参数: 无
*
* 输出参数: 无
*
* 返 回 值  : 无
*
* 注意事项: 无
***********************************************************************************************************************
*/
void SysStateMngt(void);

#endif /*STATE_H_*/

/*
***********************************************************************************************************************
                                 文件结束
***********************************************************************************************************************
*/
